{
    "version": "https://jsonfeed.org/version/1",
    "title": "Thebstar blogs",
    "description": "",
    "home_page_url": "https://www.thebstar.com/blogs",
    "feed_url": "https://www.thebstar.com/blogs/feed.json",
    "user_comment": "",
    "author": {
        "name": "Bikram Sutar"
    },
    "items": [
        {
            "id": "https://www.thebstar.com/blogs/week-1.html",
            "url": "https://www.thebstar.com/blogs/week-1.html",
            "title": "Week 1 🎬",
            "summary": "Moved to Bangalore, wasted time waiting for furniture, the cleaning guy, and some scrolling to infinity. I will call it a day for today. Week 1 starts tomorrow 🎬 I will be in Bangalore at least till December end. I saw a year progression tweet&hellip;",
            "content_html": "<p>Moved to Bangalore, wasted time waiting for furniture, the cleaning guy, and some scrolling to infinity. I will call it a day for today. </p>\n<p><strong>Week 1 starts tomorrow 🎬</strong></p>\n<p>I will be in Bangalore at least till December end. I saw a year progression tweet - 80% is done. We have only 20% left of 2024. Time to buckle up. This is a live document for week 1. </p>\n<p>Before we start, I have a few goals - </p>\n<ul>\n<li>Setup the place</li>\n<li>Hit the gym</li>\n<li>Cricket practice 2 days a week</li>\n<li>Eat and sleep well - it is a long game.</li>\n<li>Build the first version of Kidli - Web send to select parents. </li>\n<li>Build the Kidli App (ios/android) - Do a release</li>\n<li>Get 100 paid parents</li>\n<li>Publish articles - Tech, Leadership, learnings - 2 articles a week. </li>\n</ul>\n<p>Note: I might change some in November but until then let's run with these. </p>\n<p> </p>\n<p><strong>Day 0 - Sunday, October 20th 2024</strong></p>\n<ul>\n<li>Received the rejection email from <a href=\"https://www.zfellows.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">ZFellows</a> - Without any traction &amp; a co-founder it was kind of obvious. But hey, It fast-tracked my pitch deck and solidified the space. Talked to a few potential users, which I was delaying otherwise. </li>\n</ul>\n<p> </p>\n<p><strong>Day 1 - Monday, October 21st 2024</strong></p>\n<ul>\n<li>Setup wifi, room ✅, few things pending - take delivery of chair, a big bucket since the area seems to have some water issues, bedsheet &amp; a pillow</li>\n<li>Fixed gym - hitting from tomorrow. Found a cricket club - a scheduled match on Sunday. ✅</li>\n<li>Should have Kidli api running today. 🧑‍💻</li>\n</ul>",
            "image": "https://www.thebstar.com/blogs/media/posts/17/Screenshot-2024-10-20-at-8.58.07-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "startups"
            ],
            "date_published": "2024-10-20T20:55:54+05:30",
            "date_modified": "2024-10-21T20:30:11+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/i-am-flying-to-bangalore-no-more-code-words.html",
            "url": "https://www.thebstar.com/blogs/i-am-flying-to-bangalore-no-more-code-words.html",
            "title": "I am flying to Bangalore - No more code words!",
            "summary": "I am flying to Bangalore. I have been doing it three or four times a year. What is new? Only this time, I don't know when I am returning home. I am thinking of starting up. In fact, I have been thinking of starting up&hellip;",
            "content_html": "<p>I am flying to Bangalore. I have been doing it three or four times a year. What is new? Only this time, I don't know when I am returning home. </p>\n<p>I am thinking of starting up. In fact, I have been thinking of starting up for more than a decade now. My good old roommates would know that I was always interested in making an impact and building a business. I did a few business stints while I was in college. 2016 to this day, has been a build-up to making a great one. I hope so 🤞.</p>\n<p>And I feel this is the time. The next step from here - having a crack at building a billion dollar Company. Every calculation I have been running leaves me with only one possible path at this junction of life. Startup!</p>\n<p>I have been blessed to be in tech. If I crack a good product and have revenue streams, it is easier to build a venture-backed business in this space, and scale really fast. And what better place than Bangalore? I can't afford SF 😅.</p>\n<p>I have some money in the bank to pay myself a minimum salary (monthly expenses) and some for operating costs and emergencies. I have unlimited energy. You can be on 5 coffees and 3 red-bulls, and I will still beat you in the second continuous marathon, just on water. I have convinced my parents not to rush me into marriage (typical Nepali/Gorkhali parents). I have all the time on that front as well. The point is, this is the time.  </p>\n<p>I am flying to Bangalore this Sunday, October 20, 2024, to explore the next phase. I don't know where it will lead me, but I know where I want it to lead me. I don't know if I will be broke by next year, but I know I will be more than fine.  </p>\n<p>I have a fascination with hardship and challenges. I am romanticizing it already. It is a Himalayan peak climb, Mount Everest. But imagine the peak being unique to the climber &amp; the climber doesn't get Sherpas.</p>\n<p>I love the journey, or rather, I love myself enough to endure any journey; I love the peak. And the peak is the true love. </p>\n<p>Love makes it worthwhile.</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/16/Screenshot-2024-10-19-at-12.22.20-AM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "startups",
                   "life"
            ],
            "date_published": "2024-10-19T00:23:15+05:30",
            "date_modified": "2024-10-19T00:30:48+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/8020-time-to-negotiate.html",
            "url": "https://www.thebstar.com/blogs/8020-time-to-negotiate.html",
            "title": "80:20 - Time to negotiate",
            "summary": "My rough notes on trying to model a formula for deciding between two choices, A and B. There are two options, A and B. You are very much gravitated towards A. I will give this a score of 80. 80 because it is close to&hellip;",
            "content_html": "<p>My rough notes on trying to model a formula for deciding between two choices, A and B.</p>\n<p>There are two options, A and B. You are very much gravitated towards A. I will give this a score of 80. 80 because it is close to certainty but not yet certain. Only things beyond 90 inches to certainty. 50/50 is when you aren't sure. 60/40 is still in the uncertainty zone, IMO. Even the 70, on the other hand, is clarity and conviction towards A. If I follow <a href=\"https://www.seedtoscale.com/blog/kunal-shahs-delta-4-theory-of-successful-startups\" target=\"_blank\" rel=\"noopener noreferrer\">Delta 4 framework by Kunal Shah</a>, Here the Delta is 4. It 70/30 clarity rule is even practiced by Amazon in decisions making if I recall correctly. But for critical decisions, where speed still matters, 80/20 is a one. It provides a balance of clarity and certainty. 70/30 for more speed. </p>\n<p>The thought came to me while driving yesterday morning. For A/B with initial weights as x/y and it to be x'/y'. A simple formula can work. We scale B to get the new ratios. k, a multiple of B to achieve the x'/y' </p>\n<p><span class=\"base\"><span class=\"mord mathnormal\">k </span><span class=\"mrel\">= </span></span><span class=\"base\"><span class=\"mord\"><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\"><span class=\"mord mathnormal\"><span class=\"mrel\">(</span>x<span class=\"mbin\">⋅</span>y<span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">′) </span></span></span></span></span></span><span class=\"vlist-s\">​</span></span></span></span></span></span>/ <span class=\"base\"><span class=\"mrel\">(</span></span><span class=\"base\"><span class=\"mord\"><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\"><span class=\"mord mathnormal\">x</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">′</span></span></span></span><span class=\"mbin\">⋅</span><span class=\"mord mathnormal\">y) </span></span></span></span></span></span></span></p>\n<p>Using this to change an 80/20 decision to 50/51, k needs to be greater than 4.08. </p>\n<p>To change it to 20/80, k needs to be greater than 16. This means B needs to be 16x better choice suddenly compared to A. </p>\n<p>What does this mean in the real world?<br><br></p>\n<p>if you have two options, A and B. And you are 80% sure about A. You can negotiate for a B 4x better for it to win. And when you already have such a strong affinity towards A, sitting on the negotiation table doesn't harm. You come out with a 4x, or you have an A anyway. Who knows if you are even getting a 16x? It absolutely does not harm if you are comparing future optimistic value vs liquidity today.</p>\n<p>Go, use the formula. To make it more robust, you can update it with an inflation factor for money, risk &amp; opportunity cost for new opportunity cost, joy vs regret weightage for emotions, state of mind, etc. </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/15/Screenshot-2024-10-12-at-8.25.15-AM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "startups",
                   "life",
                   "fokat"
            ],
            "date_published": "2024-10-12T08:26:59+05:30",
            "date_modified": "2024-10-12T08:31:29+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-third-person-view.html",
            "url": "https://www.thebstar.com/blogs/the-third-person-view.html",
            "title": "The third person view",
            "summary": "It is funny how often I turn on my third-person view camera. Whenever I sit to do retro, reflect on emotions, or anything in life, even when I set the ideal stage for myself in the future, I look at myself from this view. Recently,&hellip;",
            "content_html": "<p>It is funny how often I turn on my <a href=\"https://simple.wikipedia.org/wiki/Third-person_view\">third-person view camera</a>. Whenever I sit to do retro, reflect on emotions, or anything in life, even when I set the ideal stage for myself in the future, I look at myself from this view. </p>\n<p>Recently, I started realizing this. A lot of the time the person in the center stage is me but detached. Has its own identity. I think I understand him the most. This has been helping me to learn more about myself. How I act, how I feel, how I react. And deduce my thoughts, actions, and reactions to points in time in life. Sometimes these points are ranges, sometimes they are absolute. They are most helpful when absolute. If everything were absolute, then life would have been less fun, and less diverse.</p>\n<p>This is a release post for something else I have been brewing. `Brewing` reminded me I just installed `homebrew` on my new Mac. Yes, I got a Mac for myself a few days ago.</p>\n<p>Dussehra is on in Assam. I will visit the pandals now. 🥳</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/14/Screenshot-2024-10-09-at-12.26.02-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "fokat",
                   "daily"
            ],
            "date_published": "2024-10-09T12:29:45+05:30",
            "date_modified": "2024-10-09T12:29:45+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/honesty-leads-you-to-god.html",
            "url": "https://www.thebstar.com/blogs/honesty-leads-you-to-god.html",
            "title": "Honesty leads you to God",
            "summary": "Hey, what are you saying? You don't even believe in god! - This is how they would react to the title. Yes, I don't believe in the traditional definition of God. Most of them sound very selfish and human. Can't be someone who created the&hellip;",
            "content_html": "<p>Hey, what are you saying? You don't even believe in god! - This is how they would react to the title. Yes, I don't believe in the traditional definition of God. Most of them sound very selfish and human. Can't be someone who created the universe. Then, do I believe someone created the universe? I don't know. This is a very blurry line. But I respect people's beliefs - it is important to call out early. </p>\n<p>You might have gotten an idea already; This isn't a spiritual guide. By God, I mean the really good quality work, the dedication, and countless hours that go unnoticed. Honesty in the process is the path to get there. It leads you to the God. It motivates you to stay strong, keep pushing, get better, and see God. </p>\n<p><a href=\"https://en.wikipedia.org/wiki/Navaratri\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Navratri</a> is going on. My mom is deeply spiritual. (Spiritual and religious are different; She might be in between, actually). She is fasting these nine days. Sleeping on the floor. She even developed shoulder pain in the last two days. People were suggesting she should sleep in bed today. I went on to check before locking my room. She is still beside her Durga maa pratima on the floor, in a deep sleep. She might be in a little pain tomorrow, but the peace she has today beats everything. </p>\n<p>What is stopping her from sleeping on the bed?  No one is watching or judging her. It is her. She is making the call. She has made a promise, and she will keep it. It might not be all comfortable, but she will do it till she can. And these honest, pure heart - no fluff efforts are what I feel are paths to god. She can't agree more.</p>\n<p>Similarly, in work or academics, these no-fluff hours separate the Best from the good. Honesty in the process and honesty with self are paths to great work. </p>\n<p>✌</p>\n<p> </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/13/Screenshot-2024-10-06-at-1.23.03-AM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "fokat",
                   "daily"
            ],
            "date_published": "2024-10-06T01:26:58+05:30",
            "date_modified": "2024-10-06T01:26:58+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/v03-t15.html",
            "url": "https://www.thebstar.com/blogs/v03-t15.html",
            "title": "V.03 - T15",
            "summary": "Everything changes. Change is the only constant. You either try hard to drive the change, try controling it or flow with the change. You have no other choice. Not every change is worth your attention. But some are. Some are worth everything. If I could&hellip;",
            "content_html": "<p>Everything changes. Change is the only constant. You either try hard to drive the change, try controling it or flow with the change. You have no other choice.</p>\n<p>Not every change is worth your attention. But some are. Some are worth everything. If I could I would put all the resources I could imagine. If it feels like this, and if it is realistic. Be optimistic about it and put everything in it. Control the change. </p>\n<p>I have been controling my change. Okay, 'Fate' - here I say the magic word. Does this mean I control everything? No, I surely can only control a very insignificant of part of this big game called Life. But this insignificant small part plays a huge part in determining my fate. If fate is the infintely running car that I can't control speed of, I can certainly control steering at times. Giving me enough control to pass by certain vallies. </p>\n<p>I don't like to sit static and react to change. I want to proactive. I want to guide them. I can't control the most part of it. But some vallies I want to visit, I will do everything to steer the engine it to take me there. It is time to steer it again. To new direction. To new valley. </p>\n<p>🚀</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/12/Screenshot-2024-10-04-at-11.01.10-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life",
                   "fokat"
            ],
            "date_published": "2024-10-04T23:07:47+05:30",
            "date_modified": "2024-10-04T23:12:23+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/t-20.html",
            "url": "https://www.thebstar.com/blogs/t-20.html",
            "title": "T - 20 🚀",
            "summary": "No, I am not referring to T20 cricket by T-20 here. I am not that mad about cricket anymore. Not mad about watching cricket anymore. It was 2012, I used to be mad about watching a game. I still play it. I enjoy playing a&hellip;",
            "content_html": "<p>No, I am not referring to T20 cricket by T-20 here. I am not that mad about cricket anymore. Not mad about <em>watching</em> <em>cricket</em> anymore. It was 2012, I used to be mad about watching a game. I still play it. I enjoy playing a lot. Infact, Cricket, Running and writting are three passive meditations for me. </p>\n<p>I just saw the scores for ongoing Bangladesh vs India match. India playing test match like a T20. Trying to force a result. Forcing a result and not being content with a draw is a new behaviour, these top boards are pushing for after WTC cycle started. Test match wins have higher prize associated, more than the mere series win earlier. <strong>A higher prize, a greater value is what driving the behaviour change.</strong> </p>\n<p>Yes, <strong>Change</strong>! Mark this word. Something is changing. Something in my life. Well, I can't open it to you now. I can only say - <strong>T-20</strong> is the count down. Nicely wraped in cricket flavour. </p>\n<p>T-20 🚀</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/11/Screenshot-2024-09-30-at-11.49.45-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "startups",
                   "daily"
            ],
            "date_published": "2024-10-01T00:01:55+05:30",
            "date_modified": "2024-10-01T00:01:55+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/faking-it-till-i-make-it.html",
            "url": "https://www.thebstar.com/blogs/faking-it-till-i-make-it.html",
            "title": "Faking it till I make it.",
            "summary": "I saw a twitter post on a few days ago. This was by none other than my great mentor Sajal. Sajal and Ateev were the two founding engineers at Orangehealth. I joined them as the 3rd engineer. Here is the thread. Little back story -&hellip;",
            "content_html": "<p>I saw a twitter post on a few days ago. This was by none other than my great mentor Sajal. Sajal and Ateev were the two founding engineers at Orangehealth. I joined them as the 3rd engineer.   </p>\n<p>Here is the thread. </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://www.thebstar.com/blogs/media/posts/10/Screenshot-2024-09-30-at-12.17.30-AM.png\" alt=\"\" width=\"582\" height=\"711\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://www.thebstar.com/blogs/media/posts/10/responsive/Screenshot-2024-09-30-at-12.17.30-AM-xs.png 640w ,https://www.thebstar.com/blogs/media/posts/10/responsive/Screenshot-2024-09-30-at-12.17.30-AM-sm.png 768w ,https://www.thebstar.com/blogs/media/posts/10/responsive/Screenshot-2024-09-30-at-12.17.30-AM-md.png 1024w ,https://www.thebstar.com/blogs/media/posts/10/responsive/Screenshot-2024-09-30-at-12.17.30-AM-lg.png 1366w ,https://www.thebstar.com/blogs/media/posts/10/responsive/Screenshot-2024-09-30-at-12.17.30-AM-xl.png 1600w ,https://www.thebstar.com/blogs/media/posts/10/responsive/Screenshot-2024-09-30-at-12.17.30-AM-2xl.png 1920w\"></figure>\n<p> </p>\n<p>Little back story - I was joining them from Radicali, at Radicali we were a bunch of young raw folks. Sajal's product engineering philosophy, combined with close look at how Dhruv (Founder @Orangehealth) operated with clarity on the product, Prathamesh's design explanation, reviews helped me build a product and user first mindset. What do I say about Ateev, he was the one always watching our back. Making it easy. Well, I can go on. How Ayush found all eges-cases on the product. Whatever minimum, I saw of Tarun handling &amp; designing operation excellence. Rajendra Sir with the knowledge. I said I could go on.</p>\n<p>Let's come back to the point. He was replying to this clickbaity tweet. I know where it is coming from. The original twitter means to not fake your status game. Don't show off. I am not here to comment on it. 'Making it' is more important to me. How people handle it after making it is a personal choice. Whether you show off, or play it under the carpet - upto you. If you feel like 'making it' is a journey, we will talk about it later. For now we will stick to 'Faking it till making it', specifically Faking before making it.</p>\n<p>Let's break it down - </p>\n<h4><strong>Making it</strong></h4>\n<p>To make it, you need a goal. You always have to start with a goal. One that you are fully committed to. A goal requires plans. Multiple plans, broken down by different milestones in the journey. Bridging the gap between today and the goal on each steps. You need to put a lot of things together to achieve this. And most important of these is putting your mental game in place. </p>\n<h4>Faking it</h4>\n<p>Yes, faking it. To be a winner you need to start thinking like a winner, work like a winner. Think you are already making it, you are destined to make it. Now, back track honestly from here. Figure out what all are you destined to do. And live it. This is what faking it is. </p>\n<p> </p>\n<p>Let's take a simplified example, </p>\n<p>Goal - Running a sub 20 5k. </p>\n<p>Planning - I have 3 months to run sub 20min 5k. And my current PR is 24 min. I have a plan prepared by an expert coach on Nike run club. The expert coach has already applied back-tracking to prepare the plan.</p>\n<p>Executing the plan, is what it requires now. When I know execution is hard, this is where people give up. Faking can really help here. Everytime I go for a run, I am the sub 20 5k runner completing his traning. Everytime I feel low, I fake it to think how would I the future, who has already run a sub 20 min 5k would pick him up. </p>\n<p>And this is how I weight my risk and opportunities as well.</p>\n<p>All of this is internal. Tricking mind to play the best, live the moment in head to prepare for reality, to bridge the gap. Elite atheletes do visualisations before games, they live the moment way before it actually happens to prepare their future self, by using their fake future self. Oh, are we in a time travel paradox? 😅</p>\n<p>Go, fake it <span style=\"text-decoration: line-through;\">till</span> to make it. </p>\n<p>Cheers. </p>\n<p> </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/10/maple-leaf-638022_640.jpg",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "fokat",
                   "daily"
            ],
            "date_published": "2024-09-30T01:09:42+05:30",
            "date_modified": "2024-09-30T09:46:02+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/do-what-you-love-or-love-what-you-do.html",
            "url": "https://www.thebstar.com/blogs/do-what-you-love-or-love-what-you-do.html",
            "title": "Do what you love, Or love what you do",
            "summary": "I wanted to be a superman. Not exactly, I never had a TV growing up. My neighbourhood of 150 homes had only 2/3 TVs. I must have been 7/8 years old. My paternal uncle (edlest of my father's sibling), used to take me to one&hellip;",
            "content_html": "<p>I wanted to be a superman. Not exactly, I never had a TV growing up. My neighbourhood of 150 homes had only 2/3 TVs. I must have been 7/8 years old. My paternal uncle (edlest of my father's sibling), used to take me to one of those neighbours. It was so fun job to be flying around, to be able to help needy.</p>\n<p>My mother once told me, and also Sree Krishna in Mahabharat (can't recall correctly) 'Wish for others, and good things will happen'.  This made so sense to my tinny brain. I had only three wishes</p>\n<p>1. Give peace to everyone.</p>\n<p>2. Give them good thoughts.</p>\n<p>3. <em><strong>And make me Shaktiman. </strong></em></p>\n<p>It continued till 2008+-1 years. I used to believe I had a deep connection with god. In 2008, I got hooked into watching cricket. And I found a new idol. Sachin Ramesh Tendulkar. So simple of a man, giving so many hopes, bringing joy. I used to find myself in him. My 2 wishes remained the same. 3rd was changed now. I provided god the option. <em><strong>Make me a Shaktiman or a Cricketer. </strong></em></p>\n<p>It was 2011, I wrote my 10th exams. I had a proper break. I used to sit and meditate for almost half an hour every evening. Also, during this time mahabharat was being re-aired. The narator `Samay (Time)`, told how it is the only constant, only flowing truth in the form of change. It also narrated `How satya, and dharma are different, and Krishna went on to explain in Geeta, that karma is dharma`. Samay even touched how dharma isn't required when satya is there. All of this played part in shaping me - I kind of stopped praying. I completely stopped worshiping. Altough I continued wishing two pointers in the first wish to come true. I still do. But, it has changed to what I can do than what would god do. Today, I don't even believe in god in the form they are described in religions. </p>\n<p>Fast forward to 2014, I just wanted to get a good govt job to make my family financially stable. I was still playing cricket and had a dream of making it big one day. But reality was more closer. I had to get a job. I hadn't tought it through to be honest. My brother always wanted to join Army. He joined them in 2015. This was a financial releif. He was just 17, his actual age. I was 18 and half. We decided if He is going through it, I have to make it big now. </p>\n<p>At this point, I knew I wasn't going to make it big in cricket. I kind of started to hate it in reality. As I saw age frauding happening at big scale from u15 days, back in 2012. Never had that real fire for it afterwards. Now since I could aford to take sometime and We decided to do somthing big, I had to find what is it. <em><strong>I figured doing Civil services would be perfect</strong></em>. I could make a lot of impact, plus make good money. But before this thought could have been matured, I joined a computer class - Nielit O level. Loved it completely, excelled at it. And suddenly the startup door was opened. </p>\n<p>I had been great with people always. Had been in between them, motivating them, guiding them. I find a different energy. Plus I bring the average up. I had been doing odd businesses and handling finances for a long lnog time -</p>\n<p>1. I had started a sim card selling business</p>\n<p>2. I was also doing a soap selling business</p>\n<p>3. I also did Chappals and Shoe selling business during my college days to support myself and the family. </p>\n<p>4. During the same time, I also tried selling utensils and notebooks. </p>\n<p>5. I was always good with money. In school days, I used to save my pocket money and lend to my father in tough times. </p>\n<p>I was kind of a book worm in school days, and I had read about a lot of famous personalities, making it big from 0. Again back in 2016, I was reading about startup folks - Bezos, Zuckerberg, Musk. Kind of impact they had. I didn't have a laptop, nor a cs graduation. But I was doing well in my computer class course work. I was already reversing arrays, checking prime numbers, building job application platform. 😅. Felt like I was built for it. Felt like I found my calling. <em><strong>I wanted to build a software company - to create something world will use, to create wealth, to have influence, to have a huge impact. </strong></em></p>\n<p>It was 2020, I was doing good at being a builder, being a software engineer. Earning decent money, giving back to society in own capacity, I realised what I always wanted to do - <em><strong>I wanted to have an impact in the world, to make it better, in whatever way I could, even say .00000001 percent</strong></em>. </p>\n<p>I am writting this in 2024. And as I look back my wishes or dreams or goals you would say, have changed over times. Yet, I have stayed relatively happy and successful (peace) during each of those phase. At times, I wasn't doing what I love. <em><strong>But I aboslutely loved what I did</strong></em>. Wise words guiding to - focus on the proccess and not results helped tremendously.</p>\n<p>Is this the complete truth? As I delved deeper, I found that I always wanted to do one thing, I always loved one thing - which is <em><strong>making an impact. </strong></em>How I expressed it changed over time, how I wanted to make this happen did chagne. But i look at the wishes, goals, core of it has been  driven by <em><strong>a fire to make an impact</strong></em>. Things are connecting now. </p>\n<p>I have a mountain to move before I sleep, and there is only a little time. </p>\n<p>See you!</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/9/Screenshot-2024-09-26-at-1.13.58-AM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life"
            ],
            "date_published": "2024-09-26T01:14:31+05:30",
            "date_modified": "2024-09-26T01:14:31+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/i-overprepared-again.html",
            "url": "https://www.thebstar.com/blogs/i-overprepared-again.html",
            "title": "I overprepared again 😐",
            "summary": "In the 2nd week of September 2024, I flew to Mumbai for my b1/b2 US visa interview. Good news is I got the visa. On this note, I am sharing how I overprepared for the interview. And how, I often at times, overprepare. The interviews&hellip;",
            "content_html": "<p>In the 2nd week of September 2024, I flew to Mumbai for my b1/b2 US visa interview. Good news is I got the visa. On this note, I am sharing how I overprepared for the interview. And how, I often at times, overprepare. </p>\n<p>The interviews were on 9th and 10th. I got good advices from Co-founders@Houseware and senior colleagues. And the visa agent too. My conclusion was to get as many documents supporting my case as possible. On 10th, the consular interview day, I had a big stack of dcouments with more than 35 pages. I was a bit early to the interview place. So, I had to wait outside, Entires were time sloted. So, I waited for my turn.</p>\n<p>I went in, waited on another queue, and finally met the interviewer. He asked a few basic questions, like - Where are you going? Why are you going? What do you do? Who is paying for the trip? And said `Your visa is approved`. Didn't look at any documents. </p>\n<p>While heading back to hotel, I started thinking, the entire stack of documents, there weren't required. No one checked them. I felt like I overprepared for it. No, I hadn't done any interview preparations, as this was more of a factual interview, not a skill or presentation. But, I had done preparation to get these documents, get them printed. All for nothing?<br><br>One part of my brain started:</p>\n<blockquote>\n<p> Hey, you prepared for the worst, and your job is a success. Why does it matter if you overprepared. What if they had actually asked for some of those documents. By preparing for the worst you were ready to face the worst. You could pull out  any document they could have asked.</p>\n</blockquote>\n<p>And the other half said</p>\n<blockquote>\n<p>Yeah, this is legit. And I am not disappointed, and since you, have nudged myself to the final outcome, I am really happy that I got the job done. But, these kind of overpreparation has led me to missing out on opportunities earlier. Always going for perfection, preparing for the worst always, have let me down. Once, I was preparing for my Google Certified Web depeoper exams. Had a long planned preparation cycle. But, they stopped giving certifications before I felt ready.</p>\n</blockquote>\n<p>First half again</p>\n<blockquote>\n<p>Oh, I see you. Going for perfection, preparing for the worst shouldn't happen at the cost of never feeling ready. Prepare for the worst, go for the perfection but within your limited resources - 'time' especially. This often works like magic when you have to run faster but at the same time have space to re-try. 80-85% success, 15% failure is a sweet spot, tight your resources by opening your mind to 85% readiness. Plan like this. Then push extra for the 100%. </p>\n</blockquote>\n<p> </p>\n<p>Makes sense now. Overpreparation is just preparation, when done with an obsession for the goal. </p>\n<p> </p>\n<p>Let's hit more goals 🎯</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/8/Screenshot-2024-09-23-at-5.46.35-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life",
                   "fokat"
            ],
            "date_published": "2024-09-23T17:47:46+05:30",
            "date_modified": "2024-09-23T17:49:39+05:30"
        }
    ]
}
