{
    "version": "https://jsonfeed.org/version/1",
    "title": "Thebstar blogs",
    "description": "",
    "home_page_url": "https://www.thebstar.com/blogs",
    "feed_url": "https://www.thebstar.com/blogs/feed.json",
    "user_comment": "",
    "author": {
        "name": "Bikram Sutar"
    },
    "items": [
        {
            "id": "https://www.thebstar.com/blogs/expectations-reality-happiness-and-peace.html",
            "url": "https://www.thebstar.com/blogs/expectations-reality-happiness-and-peace.html",
            "title": "Expectations, Reality, Happiness, and Peace",
            "summary": "Happiness is the difference between what we expect and what we experience. It is such a simple formula. A simple derivation is - lower the delta of expectations and reality, and be Happy. There are two ways to lower the delta 1 is easy. Or&hellip;",
            "content_html": "<p>Happiness is the difference between what we expect and what we experience. It is such a simple formula. A simple derivation is - lower the delta of expectations and reality, and be Happy. </p>\n<p>There are two ways to lower the delta</p>\n<ol>\n<li>Lower your expectations</li>\n<li>Improve your reality</li>\n</ol>\n<p>1 is easy. Or let's say, 1 is in your control theoretically. You are visiting a new place, meeting new people - lower what you expect. If things go well, you will be super happy. If not, you weren't expecting anything. We have experienced these kinds of experiences when we didn't have a lot of expectations, but reality treated us like the favourite child of god.  This is so easy, we have just solved the root of every grumpy face ever. Not yet. We want to get into the best university, we want to have the best food, we don't want to lower all our expectations, we can't always. Let's see if we can improve our reality.</p>\n<p>We work hard, prepare our best, give our all, and yet do not get what we expect. Only if there was a secret mantra to get it all. There are so many factors; however hard we work, we don't control all. You put on your best dress and walk into an event on a sunny day, but suddenly, on the way, you are drenched in rain. It is too late to go back home to re-dress, it is too embarrassing to go to the event all wet. Life sucks. You do you improve this? Only if there were a secret mantra to fix the dress. If there were a secret mantra to control the weather. We don't have it yet, and we are doomed. As much as we think we are special, the chances of us being here are statistically -Infinity (Negative infinity). In that sense, we are special, still here. But our every expectation has a similar low chance of getting real. Irrespective of how hard we work. I know it doesn't help. But that's the reality. </p>\n<p>Happiness is an illusion; reality is wild. Reality is a spectrum of joy, sorrow, anger, frustration, emptiness, profoundness, and whatnot. Accepting all is what being at peace is. This is the reality. And by accepting, we improve the reality. Not externally, but internally. We give our consciousness the space to flourish. Space to be the best of itself. Does this mean we accept and accept defeat? Yeah. We accept the current situation. And then, plan do we want to do next? Reflect and reset. And if we want to retry or go another route. Detach your motivation from emotions and results, and find joy in trying it well. There will be a time when you want something badly, it is fine to put everything, in fact, you should put everything, but you should know that at the same time, you don't control the results.  Krishna talks about this exact philosophy to Arjuna in the Gita. </p>\n<ol>\n<li>Accept your reality</li>\n<li>Define your path</li>\n<li>Walk the path with honesty</li>\n<li>On every stop, loop back to 1</li>\n<li>Remember, happiness is just a subset of what you are supposed to get. Be in peace.\n<ol>\n<li>Lowering expectations isn't the answer. Not when you care about reality. </li>\n</ol>\n</li>\n</ol>\n<p><a href=\"https://www.productiveflourishing.com/p/users-guide-creative-tension\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">There is a similar framework called creative tension</a>, which is similar but not exact, that talks about how you set high goals and keep everyone moving with the current reality from a leadership position. Thanks to Shubhankar. </p>\n<p class=\"msg msg--info\">Note: Originally written in 2022. Delivered a session in our poolside sessions at the Houseware retreat. We were sitting beside a pool, everyone had 30 minutes to talk about anything they wanted, and others could ask questions. I dropped - \"Happiness is an illusion, and peace is all you need\". Took everyone a while to recover 😅</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/36/Screenshot-2025-07-27-at-7.44.07-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-07-27T19:44:42+05:30",
            "date_modified": "2025-07-27T19:44:42+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/a-new-kind-of-thinking-model.html",
            "url": "https://www.thebstar.com/blogs/a-new-kind-of-thinking-model.html",
            "title": "A new kind of thinking model",
            "summary": "It is going to be a little different. It is going to be new. It is the need of the hour; we either go extinct or evolve with the tools. I guess going extinct isn't an option, not in my world. Welcome evolution. This is&hellip;",
            "content_html": "<p>It is going to be a little different. It is going to be new. It is the need of the hour; we either go extinct or evolve with the tools. I guess going extinct isn't an option, not in my world. Welcome evolution. This is a living document/journal for the evolution. </p>\n<p><strong>July 24th 2025</strong></p>\n<p>I was in an interview, and my peers asked this question to the candidate: Given that I give you an open-ended problem, how would you spend the first 24 hours? What would you do? This is an interesting question and gives so much about how people think through problems, that's their framework for solving. Some of these pieces or the entire stack is changing fast in the AI-first world. I have been thinking about this for some time. Time to put a structure around it, maybe I am not yet ready to put a structure, but let's start brewing at least. </p>\n<p>The candidate answered by saying - I would go do research, look at competitors, understand users, and would like to build a mind map around the problem. Mind map sounds so familiar, in fact, for everyone I hired, onboarded, I have given them initial space to go build their mind map and intuition of the space. I have personally done this myself so many times. It is hard to sell anything to me unless I am convinced to buy. I like to build my intuition on the product, whether I need to buy, similarly, what is the problem, why is it worth solving, and why now? Why us? What exactly does solving the problem mean? Building intuition and a mind map around connections. In the age of AI, what part of this can be delegated? What part of this is a good problem for AI? Building intuition is important, but it is also time-consuming &amp; biased towards my existing understanding/experience. And if AI works, what do I do with the free time? Do I start working on another idea? And come back once AI is done. My context switching needs to be better. As I would still like to build intuition, maybe better &amp; more efficient. How do I do this? </p>\n<p> </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-07-24T21:57:16+05:30",
            "date_modified": "2025-07-24T21:57:16+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-heist-of-the-century.html",
            "url": "https://www.thebstar.com/blogs/the-heist-of-the-century.html",
            "title": "The Heist of the Century",
            "summary": "I searched for the term curious. Found a movie titled exactly \"The heist of the century\". I, too, pulled off a heist of a similar class. Well, of a similar amount 😅 I was in the 4th standard, and I don't remember all the details.",
            "content_html": "<p>I searched for the term curious. Found a movie titled exactly \"The heist of the century\". I, too, pulled off a heist of a similar class. Well, of a similar amount 😅</p>\n<p>I was in the 4th standard, and I don't remember all the details. I remember the highlights. And that's what I'm going to share here. I was never a problematic child at home. Never really needed an intervention, apart from - eat your food. It was one fine night, I made a pact with the devil, planned a heist of exactly 100 ruppees, and did a brilliant execution. </p>\n<p>It was during the summer. My friends got into a fight over who could bring the most money to school. They could, but I was never dragged into those, as I was always everyone's favorite. Everyone wanted to share with me. But the fight this time around wasn't about eating, spending, or getting a share. It almost felt like a power game. Who has the biggest note? I had to pull myself into the game. I couldn't resist. </p>\n<p>We wrapped dinner, and everyone went to bed. As I said, I don't remember the details; I might have been 7/8 years old. I woke up around 3.30 in the morning. Went to the stand where my father had hung his shirt. Got a stool to stand on, slipped my tinny hands into the pockets. Felt the biggest note, took a look, and there was just enough light from the rays coming through the bamboo ventilators, I was a 100 ruppees note. That was enough. No one could bring that big of a note. I put the stool back where it was earlier. Laid on the bed for 1 more hour, it was the season of mangos, and I used to visit my grandmother's house, 2 houses apart, every morning. Yes, I was her favourite always. My siblings and cousins often complain about how I was the favourite, I try to reason it, but in the case of my grandmother, yes, I was her favourite. So, I went there, hid the note in a bag of old clothes. We used to walk to school, 400 meters. I picked up the note on the way to school. Successful heist of the century. </p>\n<p>If this were the end of the story, my story would have been different. Let me be more specific. During the midday break, the show started. Kids started pulling out 2, 5, and even 10 ruppes notes. I was laughing inside. Oh, poor kids, you don't know I could buy you all today. I pulled out my 100, and everyone was in awe. It must have been like them seeing god 😆. Here is the twist: everything should have a twist 🤐. On the way back from school, I said to all - Hey, let me have a treat for you all today. We went to a shop, the only shop open way back home. I remember the shopkeeper who used to adore me &amp; my brother. He said he didn't have the change. That was thoughtful. He was a wise and a man of full ethics. I don't find many people these days who wouldn't want a kid with money to spend all in their shop. </p>\n<p>I came back from school, again, on the way back, went to grandma, and hid my money. I remember loving the possession of money; I think I was going to hold on to that note just forever, never spending. But no, whoever had written the script, the story was different. While I was hiding the money at Grandma's, one of my friends met our parents on the way and told them Bikram brought a huge note to school today. \"Bikram le etro lamro hariyo note liyako thiyo aja school ma\". I almost heard that when I entered home. I knew I got caught. I don't remember my brother being in school that day. If he were there, it couldn't have been this far, either. The next thing I remember was me rushing to Grandma, saving myself from a flying stick. </p>\n<p>That early feeling of possession, that transition from free money to feeling it was my money, and holding onto it, and the power it made me feel, that stuck with me. For that, I remember saving enough to lend to my grandma and my father in my school days. And my grandma and parents used to return me with interest, I don't know if it was me figuring out the system or them teaching me savings, I like to believe it worked.  </p>\n<p class=\"msg msg--info\">Originally written in 2021</p>\n<p> </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/34/Kid-In-Magician-Hat-Sitting-On-Pile-Of-Cash.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life"
            ],
            "date_published": "2025-07-21T17:49:23+05:30",
            "date_modified": "2025-07-21T17:49:23+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-crush.html",
            "url": "https://www.thebstar.com/blogs/the-crush.html",
            "title": "The Crush",
            "summary": "I had a crush 🥰. I had shared this on my WhatsApp 2 years ago. I was talking to a friend a few days ago. I shared a song. And shared how it feels. I also shared that I had a crush. It was a&hellip;",
            "content_html": "<p>I had a crush 🥰. I had shared this on my WhatsApp 2 years ago. I was talking to a friend a few days ago. I shared a song. And shared how it feels. I also shared that I had a crush. It was a long, long time ago - Way back in school. </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://www.thebstar.com/blogs/media/posts/33/Screenshot-2025-07-20-at-12.17.32-AM.png\" alt=\"\" width=\"1488\" height=\"206\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.17.32-AM-xs.png 640w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.17.32-AM-sm.png 768w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.17.32-AM-md.png 1024w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.17.32-AM-lg.png 1366w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.17.32-AM-xl.png 1600w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.17.32-AM-2xl.png 1920w\"></figure>\n<p>This is exactly what I mean by Crush. No, it isn't a typo for Crash, which I also had a few years ago. The front bonnet of the car I was driving was destroyed. Thankfully, I wasn't even hurt. Changed me to realise small joys even more &amp; drive more carefully. Well, that's a different story. A blissful evening all by myself is better spent structuring my Crush story. </p>\n<h3>My heart dropped a beat</h3>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://www.thebstar.com/blogs/media/posts/33/Screenshot-2025-07-20-at-12.29.39-AM.png\" alt=\"\" width=\"620\" height=\"527\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.29.39-AM-xs.png 640w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.29.39-AM-sm.png 768w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.29.39-AM-md.png 1024w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.29.39-AM-lg.png 1366w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.29.39-AM-xl.png 1600w ,https://www.thebstar.com/blogs/media/posts/33/responsive/Screenshot-2025-07-20-at-12.29.39-AM-2xl.png 1920w\">     </figure>\n<p>I was at a wedding, sitting beside a beautiful lady, married. She asked me -</p>\n<p>She - When are you getting married?</p>\n<p>Me - I don't know</p>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">She - Why?</span></p>\n<p>Me - Because I haven't found anyone compatible.</p>\n<p>I didn't want to make it a long answer. I didn't want to tell her a lot, explain what I was thinking. We weren't that connected. We were in a wedding venue, and had to scream every time to be audible. I thought we could move on from the conversation with this answer. She asked</p>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">She - How? Why did you not set someone up?</span></p>\n<p>She giggled and went on to mention how everyone is doing love marriage, and not seeing someone is a bad idea. </p>\n<p>Oh, boy, for a second my heart dropped a beat. For a second, I wanted to tell her - <strong>because I HAD A CRUSH ON YOU. It was a long time back, but it was special</strong>.</p>\n<p>It would have been a scene. I don't mind paying for such a scene. You know the saying, Thoughts travel faster than light. It did, and it did ruin the scene. I didn't tell her anything. I laughed, agreed, and moved on. In an alternate universe, I would have screamed for sure. </p>\n<p> </p>\n<h3>How beautiful she is <span style=\"text-decoration: line-through;\">(was)</span></h3>\n<p>She was really beautiful. And beauty is all in the eyes; it depends on who is looking and what they are looking at. I am not gonna give specifics for you people to figure this out. And if you feel like the girl, no, you weren't. Even when we had the above conversation. I had similar conversations with a lot of you in a very similar setup. What else do we have in common to talk otherwise? Maybe that was you. Keep reading. You had a great impact.</p>\n<p>I had a crush on her. She was really beautiful. She had beautiful eyes. She was caring and full of optimism. She was so perfect. Felt my heart was beating for her - <a href=\"https://youtu.be/iasxMdSu7Jo?si=7h__RoE6Yog1wHig\">jiya dhadak, dhadak jaye (Youtube link)</a>. This was the song I had shared with my friend. </p>\n<p>The crush lasted for maybe 2/3 months. I never told her. I am the opposite of an impulse doer. In people I used to observe and observe. For things I used to procrastinate, this is my trick to stay under my budget. I was observing her - she gave me hope every day. She. gave me optimism every day. We didn't talk about these things - ever. But she did give me all the energy I needed at that time. Optimism was all I needed at that time. </p>\n<p>After 2/3 months, the crush faded away. Seeing her again never gave me the same blush. I used to have high expectations from people - on parameters like honesty, keeping a lot of self-pride, being specific and conscious about ownself. She wasn't there in many of those parameters, I realised. I still felt special, I still felt in love, but a picture of her faded in my heart.</p>\n<p>She taught me love, well, she doesn't know she taught me. She taught me the purest form of love. I used to walk on the field (Barikhar Khetir Ali) in monsoon rain, to help father in farming, I used to write songs, and I started writing poems. A heavy rain still takes me back to that feeling. I wasn't in love with her anymore; <strong>I started loving the feeling of love </strong>instead. I used to go for a run, and I thought someone was watching. This used to make me feel special; it still does. I used to write thinking someone was reading, and I still do. I am still blushing. Optimism that feeling gave me, I felt special, every time I fell, that feeling was there to pick me up.</p>\n<p>I have never described this. I don't know how to describe. I feel I can write a poem, and that will explain this better. That feeling made me cheer the monsoon rain, sing blue sky, and clouds; that feeling helped me be where I am. I am not an artist, not a school-trained traditional one, but still, that feeling made me one. Or so I like to believe. </p>\n<p> </p>\n<h3>The gift of love</h3>\n<p>As I said, her picture has faded, and I don't even remember well how she looked back then. I tried one day remembering her very hard in the middle of a reflection time, plus rain. No, I couldn't remember her face. But this feeling is eternal. This feeling of love, of being special - this is going to last with me forever. This gives me optimism, as it was a big part of the hopes I had. It is a big part of the peace I have. It is so pure, I look at parents and find the same kind of love. It is all about giving and not expecting anything in return. But it gives so much back. I have seen fathers giving up their drinking habit, and I have seen mothers becoming stronger, more resilient, confident, and independent. Love without expectations, without anything in return, does return so much more than people with expectations can ever imagine. </p>\n<p>Leaving you here with a movie that reflects a similar journey. It is a good watch and completes what I am saying here. </p>\n<p><a href=\"https://www.youtube.com/watch?v=FE0ZLvfITSc\" target=\"_blank\" rel=\"noopener noreferrer\">Nanhe Jaisalmer - Youtube link</a><br><br></p>\n<p class=\"msg msg--highlight \">Note: I didn't add details about her, no specific timelines, no specific places. I know a few people with a lot of time interested in figuring this out. I can't leave clues here. But if we had the above conversation, you would know it was you. You had a big impact, without realizing it. </p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/33/Screenshot-2025-07-20-at-8.23.21-AM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-07-20T01:07:54+05:30",
            "date_modified": "2025-07-22T09:15:12+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/parents-the-hardest-working-labour-class.html",
            "url": "https://www.thebstar.com/blogs/parents-the-hardest-working-labour-class.html",
            "title": "Parents - The hardest-working labour class",
            "summary": "Parents are the hardest-working labour class people in the world. It was summer, and I had just finished my 6th-grade half-yearly exams. All I could think about was a blissful 30-day vacation filled with cricket. But one pivotal afternoon, my plans unexpectedly changed, leading me&hellip;",
            "content_html": "<div class=\"xdj266r x14z9mp xat24cr x1lziwak x1vvkbs x126k92a\">\n<div dir=\"auto\">Parents are the hardest-working labour class people in the world.</div>\n<div dir=\"auto\"> </div>\n</div>\n<div class=\"x14z9mp xat24cr x1lziwak x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">It was summer, and I had just finished my 6th-grade half-yearly exams. All I could think about was a blissful 30-day vacation filled with cricket. But one pivotal afternoon, my plans unexpectedly changed, leading me to discover a deep respect for the hardest-working people I know: my parents.</div>\n<div dir=\"auto\"> </div>\n</div>\n<div class=\"x14z9mp xat24cr x1lziwak x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">It <a class=\"html-a xdj266r x14z9mp xat24cr x1lziwak xexx8yu xyri2b x18d9i69 x1c1uobl x1hl2dhg x16tdsg8 x1vvkbs\" tabindex=\"-1\"></a>was just past 2 PM, and I was ready for a day of play after lunch. First, I needed to get a jar of water to my dad, who was working under the scorching sun on an MGNREGA project, just 800 meters from our house. I raced over, handed him the jar, and was about to head back when he asked me to fill in for him for just 15 minutes while he fed the cows.</div>\n<div dir=\"auto\"> </div>\n</div>\n<div class=\"x14z9mp xat24cr x1lziwak x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">I agreed, although I managed to negotiate it down from the 30 minutes he originally asked for. There I was, shovel in hand, helping to dig a pool. I was annoyed at missing out on time with my friends. Minutes turned into hours, stretching unexpectedly until 4 PM. We were done for the day.</div>\n<div dir=\"auto\"> </div>\n</div>\n<div class=\"x14z9mp xat24cr x1lziwak x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">Walking home, I was furious. I felt tricked and disappointed. I couldn’t even look at my dad when I saw him still working on our farm. In a burst of anger, I threw the water jar aside and vented all my frustrations. That night was restless, filled with rage and tears.</div>\n</div>\n<div class=\"x14z9mp xat24cr x1lziwak x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">The next morning, with my anger slightly gone, I decided to go back to work. Maybe part of me wanted to make him feel guilty.</div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\">I worked the entire day and realized just how much my father did for us. Even the previous day, while I was at the pool, he was still working on the farm. The work at the pool was relatively easier, and there were many others like him, working hard for their families, some only a few years older than me. I realized it was an opportunity to help the hardest-working person I knew. I could still play after 4 PM. I returned home that day and decided to continue working with a smile. For the next 20 days, I worked not out of obligation, but out of deep respect and joy in sharing these burdens.</div>\n<div dir=\"auto\"> </div>\n</div>\n<div class=\"x14z9mp xat24cr x1lziwak x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">Each day revealed more about my parents' daily sacrifices, showing the depth of their commitment and love. Those days deepened my respect and love for them. I understood just how much they did for us. Every drop of sweat, every decision, every sacrifice was clear, maybe I still can't comprehend everything.</div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\">The sweet moments felt sweeter, and the hard times seemed easier. They could no longer trick me with claims like - they enjoyed grinding in the sun, or they disliked our favorite sabji so we siblings could eat more, or they preferred hard food so we could enjoy the tender parts. </div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\">Note: Converted from my phone notes. Had published on FB a long time ago. </div>\n</div>",
            "image": "https://www.thebstar.com/blogs/media/posts/32/Screenshot-2025-07-12-at-10.27.06-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life"
            ],
            "date_published": "2025-07-12T22:27:46+05:30",
            "date_modified": "2025-07-12T22:27:46+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-playlist.html",
            "url": "https://www.thebstar.com/blogs/the-playlist.html",
            "title": "The Playlist",
            "summary": "A friend sent me her playlist today. I had asked for it, and it made me think: if life were like a Spotify playlist. If you could pick only songs you like, and play them on loop. If you could select people, select moments, and&hellip;",
            "content_html": "<p>A friend sent me her playlist today. I had asked for it, and it made me think: if life were like a Spotify playlist. If you could pick only songs you like, and play them on loop. If you could select people, select moments, and put them on a playlist, and if you could replay some of them. </p>\n<p>I don't feel like writing more. I have pretty much said everything I wanted to say above, and I will add just a few more lines. Indeed, life is like a playlist - you can almost always choose people you want to be friends with, people you want to work with, and you can even tune people at times to what you want them in your playlist to be. Okay, life is more like a free Spotify account. You get to build a playlist, but you have to try songs, artists, and in the process, sometimes it is fine to not like some. Put the best in your playlist. Doesn't mean the song is bad. Someone put their soul into it. Some billion people listened to it. Somehow, after a week, you are in a different mode, and suddenly you like the song. Life changes right!</p>\n<p>Life changes, so do our choices. They change themselves, and they change others too. I said free Spotify, do you recall? Free Spotify comes with unavoidable ads, the sorrows of life. You don't like it, but you can't skip. Hold yourself together, it will pass. It always passes. </p>\n<p>Try more, add more songs, or just play the recommended one. If you feel adventurous, try a new genre. Do it your way; it is your playlist. Remember one thing, the joy of having a playlist is in playing it, listening to it. </p>\n<p>Enjoy your playlist, I am enjoying the one shared with me. It is playing. 🎼</p>\n<p> </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/31/Screenshot-2025-07-11-at-7.40.27-AM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life"
            ],
            "date_published": "2025-07-11T07:41:18+05:30",
            "date_modified": "2025-07-12T22:32:22+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-ego-of-a-conversation.html",
            "url": "https://www.thebstar.com/blogs/the-ego-of-a-conversation.html",
            "title": "The ego of a conversation",
            "summary": "Have you watched Doctor Strange (2016) (YouTube link)? If you haven't already, do watch before reading further. Click on the link above. It is just a 2-minute scene in 2x. Great. In the scene, Strange traps Dormammu in a time loop. Strange keeps coming back,&hellip;",
            "content_html": "<p data-start=\"1300\" data-end=\"1333\"><a href=\"https://youtu.be/LrHTR22pIhw?si=I5Ezz3d6AKlnzVvL\" target=\"_blank\" rel=\"noopener noreferrer\">Have you watched <strong>Doctor Strange (2016) (YouTube link)</strong></a>?<br data-start=\"1372\" data-end=\"1375\">If you haven't already, do watch before reading further. Click on the link above. It is just a 2-minute scene in 2x.</p>\n<p data-start=\"1300\" data-end=\"1333\">Great. In the scene, Strange traps Dormammu in a time loop. Strange keeps coming back, again and again, repeating the same thing while Dormammu gets increasingly frustrated. You watched it right 🙄</p>\n<p data-start=\"1553\" data-end=\"1697\">On paper, it’s a one-sided conversation. But <strong data-start=\"1619\" data-end=\"1659\">that conversation has enormous value</strong>. It decides the fate of the universe. And if my conversations were of that magnitude, I’d also show up endlessly. No hesitation. No fatigue. No complaints.</p>\n<p data-start=\"1819\" data-end=\"1897\">But most conversations aren’t Dormammu deals.</p>\n<h3 data-start=\"1904\" data-end=\"1929\"><a href=\"https://dictionary.cambridge.org/dictionary/english/ego\" target=\"_blank\" rel=\"noopener noreferrer\">Ego</a> - Red vs Green</h3>\n<ol>\n<li><span style=\"color: #2dc26b;\"><strong>Green ego</strong> - Your idea or opinion of yourself, your feeling of your importance, and your ability</span></li>\n<li><span style=\"color: #e03e2d;\"><strong>Red ego</strong> - Hidden, unspoken desires, resulting in real-world demand</span></li>\n</ol>\n<p data-start=\"1931\" data-end=\"2034\">Dormammu, in that scene, is all <span style=\"color: #e03e2d;\"><strong data-start=\"1963\" data-end=\"1974\">Red Ego</strong></span>.<br data-start=\"1975\" data-end=\"1978\">He’s demanding outcomes, submission, his way or nothing.</p>\n<p data-start=\"2036\" data-end=\"2239\">Strange, on the other hand, carries a <strong data-start=\"2074\" data-end=\"2087\"><span style=\"color: #2dc26b;\">Green Ego</span> </strong>- a healthy, maybe a bit overconfident awareness of his worth. He knows what he’s capable of. He knows why he matters. He knows what the stakes are. And that’s why he can endure the loop.</p>\n<p data-start=\"2036\" data-end=\"2239\">He’s not chasing Dormammu’s validation. He’s protecting the world. Doing his duty. That's the conversation.</p>\n<h3 data-start=\"2357\" data-end=\"2388\">My green ego</h3>\n<p data-start=\"2390\" data-end=\"2532\">I try to protect my <span style=\"color: #2dc26b;\"><strong data-start=\"2427\" data-end=\"2440\">Green Ego</strong></span> in a conversation.<br data-start=\"2448\" data-end=\"2451\">I know why I am in it.  And frankly, I’m overconfident about it. Hence, I won't ever pull out the awkwardness trick. Awkwardness in these situations is real. But think deeply, and awkwardness is nothing but an illusion for underconfidence or a conversation not having a green ego. </p>\n<p data-start=\"2534\" data-end=\"2734\"><strong data-start=\"2534\" data-end=\"2572\">Yes, each conversation should have an ego</strong><br data-start=\"2572\" data-end=\"2575\">A healthy, <span style=\"color: #2dc26b;\"><strong data-start=\"2586\" data-end=\"2599\">Green Ego</strong></span> in a conversation means it sustains itself.<br data-start=\"2643\" data-end=\"2646\">People feel its value, the importance. Everyone wants to return. It has dignity. It has momentum.</p>\n<p data-start=\"2736\" data-end=\"2913\">When a conversation lacks that when it’s one-sided, when it needs to be dragged, my Green Ego reminds me I’m not stuck in a time loop. And unless I am dealing with Dormammu, I should not create the loop. </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/30/Screenshot-2025-07-10-at-1.49.01-AM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life",
                   "fokat"
            ],
            "date_published": "2025-07-10T01:50:06+05:30",
            "date_modified": "2025-07-10T01:51:23+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-great-banyan-tree.html",
            "url": "https://www.thebstar.com/blogs/the-great-banyan-tree.html",
            "title": "The Great Banyan Tree",
            "summary": "A few days ago, I visited the Indian Botanical Garden in Kolkata. Saw the legendary Great Banyan Tree, a living marvel that’s been around for more than 250 years. 250 years in a human lifetime is 6 generations at least. Nature always finds a way&hellip;",
            "content_html": "<p data-start=\"209\" data-end=\"540\">A few days ago, I visited the Indian Botanical Garden in Kolkata. Saw the legendary Great Banyan Tree, a living marvel that’s been around for more than 250 years. 250 years in a human lifetime is 6 generations at least. Nature always finds a way to humble me. Trust me, this story isn't about humility. </p>\n<p data-start=\"542\" data-end=\"861\">The original trunk of the Great Banyan was removed long ago. Yet, the tree still stands, spreading over acres, with its aerial roots dropping down, taking hold. If you didn’t know, you’d assume it’s a forest. Me being me, my overthinking brain found a metaphor for life, not just in a biological sense, but in the way existence connects us through generations.</p>\n<p data-start=\"997\" data-end=\"1338\">Each of those roots felt like a child, a grandchild, a descendant carrying forward the life of the original. Every new branch, every fresh root that touched the earth and turned into a trunk, was like a new life, and yet, it was still the same tree. The main trunk may be gone, but its spirit, its essence, continues through its extensions.</p>\n<p data-start=\"1340\" data-end=\"1753\">It made me think about how we humans and perhaps all living things have the same kind of legacy. You can choose how far back you want to go before you call something new, or still part of the old. Some people see life as a single event: a frame between birth and death. Others, maybe just me, are starting to sense it as a continuous thread, a series of connected moments, lives, and dreams that echo through time.</p>\n<p data-start=\"1755\" data-end=\"2095\">No matter how different I feel from my parents, no matter how much my choices, thoughts, or circumstances might diverge from theirs, I realize I’m still living a continuation of their dreams. And they were, in turn, carrying forward the hopes of their parents. That invisible connector persists. You can feel it if you look closely enough.</p>\n<p data-start=\"2097\" data-end=\"2478\">Even though I have no record or knowledge of what my ancestors dreamed a thousand years ago, some part of those aspirations, fears, instincts, and strengths have surely passed down through time, embedded in stories, choices, and even in silence. Maybe the ‘main trunk’ isn’t a person, or a single event, but this vast, unseen, breathing Tree of Life itself - alive in us, through us.</p>",
            "image": "https://www.thebstar.com/blogs/media/posts/27/WhatsApp-Image-2025-07-01-at-10.22.37-PM.jpeg",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life"
            ],
            "date_published": "2025-07-01T22:39:54+05:30",
            "date_modified": "2025-07-01T22:39:54+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/what-can-i-get-done-52-week-sprints-2025.html",
            "url": "https://www.thebstar.com/blogs/what-can-i-get-done-52-week-sprints-2025.html",
            "title": "What can I get done (52-week) - 2025",
            "summary": "Elon acquired Twitter, renamed it to x.com, and laid off a significant workforce, yet it continues to thrive, even more efficiently. This one question from him is doing rounds on x.com - 'What did you get done this week?'. By asking this every week, I&hellip;",
            "content_html": "<p>Elon acquired Twitter, renamed it to x.com, and laid off a significant workforce, yet it continues to thrive, even more efficiently. This one question from him is doing rounds on x.com - 'What did you get done this week?'. By asking this every week, I can infuse the urgency. The answer to this should be directional. There should be a goal I am working towards every week. This is a living document of 52 sprints. Read the `theme for the year` from the table of contents. </p>\n<p>Let's start ⚡</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1j0kho7102\">July 14th, week 29th</a></li>\n<li><a href=\"#mcetoc_1ivhe1f6d3q\">July 7th, Week 28th</a></li>\n<li><a href=\"#mcetoc_1iv3dil5414\">July 1st, Week 27th</a></li>\n<li><a href=\"#mcetoc_1ipg9p4jh4a\">April 23rd, Week 17th</a></li>\n<li><a href=\"#mcetoc_1ipg9p4jh4b\">April 10th, Week 15th</a></li>\n<li><a href=\"#mcetoc_1inmm5m8i4t\">March 31st, Week 14th</a></li>\n<li><a href=\"#mcetoc_1in9scsd8ei\">March 26th, Week 13th</a></li>\n<li><a href=\"#mcetoc_1in9scsd8ej\">Week 4 (Week of 20th Jan)</a></li>\n<li><a href=\"#mcetoc_1in9scsd8ek\">Week 1 to 3</a></li>\n<li><a href=\"#mcetoc_1in9scsd8el\">Theme for the Year</a></li>\n</ul>\n</div>\n<h2>July 24th, week 30th</h2>\n<p>22 more weeks to go. I can write a few small sentences in Sanskrit, finally. Have exactly 22 weeks to become more fluent. Learn more words &amp; cases. Let's limit this to 10 weeks from next Monday. I can start reading small novels post that. To keep the interest going and go deeper into the language. Let's do the update</p>\n<ul>\n<li>Health ✅. I have been doing runs, I have been playing, waking up on time, and sleeping almost on time. It's been a streak run for the last couple of weeks. \n<ul>\n<li>I had a long streak of regular crunches going. Broke the streak when I travelled to Bangalore last time, been a month. I should get back this week. </li>\n</ul>\n</li>\n<li>Knowledge ✅ - Personally, as mentioned can write a few small Sanskrit sentences.\n<ul>\n<li>Professionally, I have found a few places to grow. As the team grows, as I can foresee, scale problems - I have been trying to predict and build systems, technical &amp; people enablement. I have reset my calendar to reflect the same. Feels like re-writting my role, a sign of growth. I should read staff engineer articles this week &amp; update Sonesh. </li>\n<li><span style=\"color: #e67e23;\">Can I plan on getting back on technical writing or building? Let me plan this weekend</span>. </li>\n</ul>\n</li>\n<li>Wealth - Bearish week. 🙁. I have just been holding. </li>\n</ul>\n<h2> </h2>\n<h2 id=\"mcetoc_1j0kho7102\">July 14th, week 29th</h2>\n<p>Welcome to another Monday. Had a great last weekend. Felt like a complete reset, and felt like a long, long weekend. Let's have another great week. ✌</p>\n<p>Update July 19th, Saturday 12.05AM 😄</p>\n<p>I had my laptop on my side for some time to write this. Got late. This was a good week. At work didn't even realise how fast it flew. Went to attend an event on Monday. Father wasn't feeling well, took him to the hospital on Tuesday. And I was kind of covering up for the week. That's the reason, IG. But the week itself was very productive. Have set up a sync going with a very senior dev on org impact. In my team, it is time for me to step up for the scaling of our systems, today was mostly that. </p>\n<p>Personally, Have been consistent with runs. Did a 7K 🎉. Oh, I am still good, I am the best. Let's go to specifics</p>\n<ul>\n<li>Health ✅ - feeling good. Had a few good runs. Can be part of some more family chores. Gonna get them done on the weekends.</li>\n<li>Knowledge ✅ - Learnt a few sentences of Sanskrit. Gonna complete the 100th page this weekend. That WILL BE 25%. </li>\n<li>Wealth 🚫 - Haven't done anything. The 5% I made last week went up to 22%. Should have exited. Got greedy or better lazy. I do this. I must sell within a week &amp; rebalance. </li>\n</ul>\n<p>Should do more tech exploration this weekend. And some more family time. Will update by Sunday. </p>\n<p>Update Mon July 21st, 12:03AM</p>\n<p>Didn't do much technical or reading this weekend. Saturday was spent on earth filling the new plot we bought. Went to Konoka village resort on Sunday. Had some fun. Did some activities and fun clicks. Maybe I am better at a beach or a park, or similar places with my old clothes, where I don't have to think about getting them cleaned up after reaching home. 🤣</p>\n<p>Having a light headache, need to fix my slowly slipping sleep schedule. SHUT DOWN BY 11:40 pm. Next week's goal. </p>\n<h2 id=\"mcetoc_1ivhe1f6d3q\">July 7th, Week 28th</h2>\n<p>Almost feels like a repetition. Doesn't it?</p>\n<p>What's the value of progress if it isn't directional? What's the value of speed if it is an oscillation?</p>\n<p>I am part of Sikhsya Kalyan Nyash, which aims to elevate the educational environment in the area, but most I have seen is facilitation. But it is understandable, as most people don't have time, so they would rather give out money. Yesterday received the 3rd-yearly book they published. I had been contemplating whether to continue with it, the membership. Maybe it isn't much financially. But, you know, it isn't easy for me to just not be involved. Guess I will have to learn. </p>\n<p>I would like to bring color coding back again</p>\n<ul>\n<li>Health - Played a few games ✅, in a very healthy mind state.\n<ul>\n<li>I did take a few personal stances last week. I did put a status - It happens some fights I can't lose, even though I don't want to fight. So better to fight and fight for the glory. <a href=\"https://x.com/thebstar13/status/1939676038235365505\">Read the tweet</a></li>\n</ul>\n</li>\n<li>Wealth - Haven't done anything here 🛑</li>\n<li>Knowledge - Just random reads, I gotta do better. Also, it is July, so, I should focus on learning a language. I don't want to come back and say I didn't learn a new language. 🛑</li>\n</ul>\n<p><strong>Update July 11 🕺</strong></p>\n<ul>\n<li>I feel I am back here. My schedule is patched back. One of the reasons I want to fly to Bangalore in July to meet new folks &amp; Div, but don't want to fly to not messing up my schedule. Gotta continue it for some time without any disruption.</li>\n<li>With a few runs, games this week, health goals are checked ✅. Sleep is perfect.</li>\n<li>On wealth: Haven't made any money but have surely taken a few bets this week. This is new for the year. It is happening. ⚡</li>\n</ul>\n<p><strong>July 12</strong></p>\n<ul>\n<li>This week was a solid ✅</li>\n<li>I did some building -&gt; <a href=\"https://x.com/thebstar13/status/1944012117591695640\" target=\"_blank\" rel=\"noopener noreferrer\">Built an AI browser prototype</a></li>\n<li>Have done a few good runs with my brother</li>\n<li>Have been back at learning Sanskrit\n<ul>\n<li>I have a 400-page book, down to the 86th page. </li>\n</ul>\n</li>\n<li>I tried some bets on the wealth side, got a 5% return in a week. Mainly, it was a bullish week. </li>\n<li>And I have one more day, this feels like me. Let me add a dance emoji 🕺</li>\n</ul>\n<p><strong>Running fixes me everytime</strong>. And writting, Plus conversations with same brain wave people. </p>\n<h2 id=\"mcetoc_1iv3dil5414\">July 1st, Week 27th</h2>\n<p>Well, it's been a long, long time. 10 weeks 🤡</p>\n<p>Honestly, have done nothing from this list. </p>\n<p>- Have played a handful of cricket. Visited Kolkata. </p>\n<p>I was regular at the fitness for some time, but went to Bangalore last week and continuity was broken. Need to get back this week. </p>\n<h2 id=\"mcetoc_1ipg9p4jh4a\">April 23rd, Week 17th</h2>\n<p>Was in Bangalore last week, week 16th. Back home now. The good news is knee felt really good last week. Didn't even feel a pinch in slow runs. It still hurt when I went full-blown sprinting. Bad news - didn't do much activity last week. I am home this week. The schedule will be back. </p>\n<p>Did an all-nighter on Monday as I was feeling a little rusty. Still, this week will be a mix of work, hustle &amp; social events - have a few weddings to attend. </p>\n<p>We had company on-site, and met everyone in India. I met the spaces team. Pretty cool to see everyone in person. </p>\n<p>I pulled the Google Analytics today, so good to see Kidli getting organic signups. I am sitting at 8. Not much, but yes. Should I build the thing? Considering I have MSFT credits and just put it online. Maybe I should. </p>\n<ol>\n<li><span style=\"color: #2dc26b;\">1 run exactly, a few pushups</span></li>\n<li><span style=\"color: #169179;\">Did some reading - Leading effective engineering</span></li>\n<li><span style=\"color: #f1c40f;\">Met friends, work friends. </span></li>\n<li><span style=\"color: #e03e2d;\">Didn't do any building on side. </span></li>\n<li><span style=\"color: #2dc26b;\">I have setup 1:1 with a very senior engg in LD. I should do this with more folks and learn from them.</span></li>\n</ol>\n<h2 id=\"mcetoc_1ipg9p4jh4b\">April 10th, Week 15th</h2>\n<p>Have been holding up well in terms of fitness. Waking up early, sleeping probably less than ideal. But exercising well. Knees are starting to feel a little better. </p>\n<p>Haven't read anything this week so far. Haven't published anything so far. BAU in work life. </p>\n<h2 id=\"mcetoc_1inmm5m8i4t\">March 31st, Week 14th</h2>\n<p>I have a few (two or three) sit-downs in front of computer tasks, each lasting 15-30 minutes, but I have procrastinated. This is the week I shall get them done. </p>\n<p>Update on last week, Did one good run. A couple of stretches. Okay, I won't count them as quality/intent wasn't there. Did some reading - Thinking in Bets and Consumption. Got good sleep.</p>\n<p>Cricket season has winded up. I also felt like taking a rest last week. Still got pulled into 2 matches. Wasted my time wildly last week. I binge-watched Marvel Punisher. Woke up way out of schedule on Saturday &amp; Sunday. Full awake midnights give me energy. This week I plan to use them in a more like 'me'. 🤘</p>\n<ol>\n<li><span style=\"color: #169179;\">Get good 3 runs &amp; 7 days of full body stretch. </span></li>\n<li><span style=\"color: #ba372a;\">MCP, set up</span> &amp; <span style=\"color: #169179;\">play with them</span>. <span style=\"color: #ba372a;\">Post something by the end of the week.</span></li>\n<li><span style=\"color: #169179;\">Read. I have a new book on leading engineering teams that I haven't opened.</span> I have exactly two Assamese books I bought from a book fair 2 months back, I haven't opened them yet. Not sure if I will end up opening the Assamese book. Will take a hell lot of energy from me to do that. One isn't fiction so maybe I will open it. </li>\n<li><span style=\"color: #ba372a;\">By the weekend - close all housekeeping digital work pending on me. </span></li>\n</ol>\n<p>Update here by the end of the week. </p>\n<p>Update: Week went well in terms of all 3 but the 4th item. I don't know if I will ever open those Assamese books.</p>\n<h2 id=\"mcetoc_1in9scsd8ei\">March 26th, Week 13th</h2>\n<p>Honestly, I don't remember which week this is (the 13th, I googled it). I haven't been able to tick anything from the above list. Although</p>\n<ul>\n<li>Health\n<ul>\n<li>I have been sleeping well. A good number of hours. ~8. I want to bring it down to 6/7. </li>\n<li>I have also started doing a few runs. Not regular yet.</li>\n<li>Physically, look-wise, I am not way far from abs. I have maintained where I got by the end of 2024. </li>\n<li><span style=\"color: #f1c40f;\">My diet can be better.</span></li>\n<li><span style=\"color: #e03e2d;\">I have developed lower back pain &amp; knee pain. Have been working on recovery. Getting better. It should go away in the next 2 weeks. </span></li>\n<li><span style=\"color: #e03e2d;\">Should hit the gym. </span></li>\n</ul>\n</li>\n<li>Learnings &amp; Build\n<ul>\n<li>I have been reading books - Recently reading Thinking in Bets.</li>\n<li>I have built a few new POCs, on the build side, all on my Git Hub - https://github.com/thebstar. </li>\n<li><span style=\"color: #e67e23;\">Still running behind on the latest AI stuff, practically. </span></li>\n</ul>\n</li>\n<li>Growth &amp; Investment\n<ul>\n<li><span style=\"color: #169179;\">I have started technical advising in a tech startup. <a href=\"https://spacesos.com/\" style=\"color: #169179;\">https://spacesos.com/</a></span></li>\n<li>I have set up some passive investments. Long term investments</li>\n<li>I have been looking to set up at least one manufacturing plant that in theory will give me a good return. </li>\n<li><span style=\"color: #e03e2d;\">I haven't yet worked on how many people I reached, branding. My next update should have something on it.</span></li>\n</ul>\n</li>\n<li>Hobby &amp; fun\n<ul>\n<li>I have played a lot of cricket matches. It will slow down now since season is mostly over.</li>\n<li><span style=\"color: #e03e2d;\">I haven't progressed much in new language learning. Maybe I shall go and practice with someone. </span></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"mcetoc_1in9scsd8ej\">Week 4 (Week of 20th Jan)</h2>\n<ol>\n<li>Health - Resume Gym (have been off from mid-2024)</li>\n<li>Leverage -\n<ul>\n<li>Money - I have 1L to play around and generate a return from the market/crypto/physical investment. Set up a plan/schedule this week. So that I can start thinking/executing from next week. Can I grow it X% in 3 months (X to be filled)?</li>\n</ul>\n</li>\n<li>Knowledge\n<ul>\n<li>Get back to reading AI.</li>\n<li>Be on track to complete 11th math by next week.  </li>\n</ul>\n</li>\n</ol>\n<h2 id=\"mcetoc_1in9scsd8ek\">Week 1 to 3</h2>\n<p>I didn't get anything done in these 3 weeks that aligned with the direction I had set. I am here finalizing the direction on the <strong>4th week, 20th of Jan</strong>. Hence, Can I say I created the clarity? Saying this, I did start re-reading the 11th Math book. Read Set theory, functions, and Relations.</p>\n<p> </p>\n<h2 id=\"mcetoc_1in9scsd8el\"><strong>Theme for the Year</strong></h2>\n<ol>\n<li>Leverage - Wealth, brand. Questions to answer - <br>\n<ul>\n<li>How much money did I make?</li>\n<li>How many people did I reach?</li>\n<li>How many valuable connections did I make?</li>\n</ul>\n</li>\n<li>Health - Let's have the visible abs this year. If not this year, it isn't happening anytime. Questions to answer\n<ul>\n<li>What did I do this week to have visible abs?</li>\n<li>Did I sleep well? Overslept, under-slept?</li>\n</ul>\n</li>\n<li>Knowledge - Be on top of AI and establish engineering excellence in the network. Math is back. \n<ul>\n<li>What did I learn?</li>\n<li>What did I build &amp; publish on the web? Engineering Article, new product, open source contribution?</li>\n<li>What did I read?</li>\n<li>What did I learn in math?</li>\n</ul>\n</li>\n</ol>\n<p>Additionally, I will pursue items from the following list, but all of them are secondary, and I shouldn't be judged on them.</p>\n<ul>\n<li>I have a wishlist that includes playing plenty of cricket matches.</li>\n<li>Learning a language (my goal for 2024). </li>\n<li>Continue my social &amp; community work\n<ul>\n<li>I am mostly putting a full stop on running the cricket club. </li>\n<li>And I am putting a full stop to active social work on commitment. I won't hold any positions. </li>\n<li>I will evaluate mid-year if I want to continue the kids' enablement sessions</li>\n<li>What's the most impactful thing I can do for the community? </li>\n</ul>\n</li>\n</ul>\n<p> </p>",
            "image": "https://www.thebstar.com/blogs/media/posts/25/Screenshot-2025-01-20-at-9.21.20-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "daily"
            ],
            "date_published": "2025-01-20T21:20:26+05:30",
            "date_modified": "2025-07-24T21:31:13+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-horizon-december-2024.html",
            "url": "https://www.thebstar.com/blogs/the-horizon-december-2024.html",
            "title": "The Horizon - December 2024",
            "summary": "It was 2011. Mom used to do her evening Puja, and I used to sit on a chair outside, soaking it, kind of passive-meditating, those sessions used to last 20 to 45 minutes. Most of that time was spent thinking, daydreaming, and chanting. I was&hellip;",
            "content_html": "<p>It was 2011. Mom used to do her evening Puja, and I used to sit on a chair outside, soaking it, kind of passive-meditating, those sessions used to last 20 to 45 minutes. Most of that time was spent thinking, daydreaming, and chanting. I was an introvert; I always had a vivid imagination and could create a scene and play in my head during the sessions. During these times, the things pondered were - <em><strong>How can someone work every day? Without play? How hard must it be to be an adult?</strong></em></p>\n<p>I still can't understand how people work without play or fun. They must have fun in their own way. But after working full-time for the last six years, I have started working every day. I didn't touch my laptop from the 21st to the 30th of December, and this is the longest streak without work in my career. I will be out of the office until the 6th of January 2025. This is a good reset before the new year, but I am not used to it. And I couldn't stop myself from pulling out my laptop today. </p>\n<p>Year-end is a good time to reflect and plan for the coming year. Some people argue it is just another cycle of the sun, yes, it is. But every new round is an opportunity to let go of burdens &amp; start afresh. <em><strong>Every new cycle is the beginning of New Hope</strong></em>. May it be entirely new, or may it be compounding. I have been talking about my life working in cycles. And funnily, a very hard-working, thoughtful, and relatively successful friend mentioned another angle of looking at the cycles. Three years is the optimal time I have found to be working on one cycle, for me. This is a number that makes more sense looking back. </p>\n<p>The end of each cycle is a new beginning. I am wrapping up the last cycle and sitting on the horizon for the next to begin. My birthday falls in Feb, but I keep a count of December, It is a great time for a new start. Gives me a head start of 2 months. 2024 has been a kind year. <strong>For the few of you who know, </strong>2016 to 2019 was finding my feet, 2019 to 2021 was redemption. 2022 was a break year. I wanted to step back and break out of habits and schedules - although all were good habits. I put on 14 extra kgs. I Lost them in 2023 in the first 2 months. 2023 and 2024 were supposed to be the prep year. And so they were. So,<strong> where am I now? Where do I want to head?</strong></p>\n<p>Let me answer my approach to living first. This would flow into where I am. And where I want to head. In one of the interviews - either Gayle or Darren Sammy said - We west Indians live like there is no tomorrow. It was surely a decade ago. It was in my mind, but it got into my way of living only a few years ago. I lost one uncle in the village, who was very supportive of us in our hard times. I was sad for a bit. I am very realistic about life. I tried to understand the emotion, and it turned out - I was sad because I wanted to say how grateful I was to him and how much he meant to me. Life gave me a chance when He was alive; I didn't take it. I never thought I had limited time, yet we all have limited time. <strong>Rule no 1: Think there is no tomorrow - while treating people. Rule no 2: Death is eventual; be prepared for it, The way to be prepared is to have no regrets and have pride in myself.</strong> I stole it from a Hindi movie called - Roudi Rathor. Action-Drama, if you have a hell of free time, then Bollywood can kill time. </p>\n<p>Rule 2 to live is a bit meta, let's break it down. What does it mean to have no regrets? What does it mean to have pride? Oh, you might be looking for where I stand in life. This paragraph should answer it. Back to regrets and pride. We all mess things up. And regret not taking an alternative. But can we not take an alternative after X days? Let's say - I had an ugly fight with a hostel mate, and one part of my brain says the fight wasn't required, and my ego says I stood up for myself. When my ego settles down in two days, it might be too late to settle things up. This is where I would regret not settling it earlier. But not with rule 1. I wouldn't pick up the fight in the first place, and if even 1% of my brain says that wasn't required, I would go settle it up. Even after 10 days later. <strong>Regret is a missed opportunity</strong>. And when it comes to people, you always have an undo button unless time runs out. And it does run out very fast. But how do you not have regrets for, let's say, not scoring enough in 12th? Well, I can't do anything about it now, you can theoretically solve a math problem by proving it is unsolvable. Similarly, if I can't solve a situation in life, it is the reality. I have to accept and make the changes today with all the learnings. What about pride, then? Well, <strong>pride is pretty much a feeling of excellence</strong>. An honest answer to \"Did I give it my all\"? I am not too fused about Did I get it all? With all the resources I had, did I do justice? <strong>\"With a relatively good brain and a good mind, did I create the impact in the world in my capabilities, or did I try my best to create it\"? </strong><em>This is the question for me. </em></p>\n<p>I have broken down the Rule 2 in the above paragraph. As you might have noticed, both Rules 1 and 2, and almost all my conversations are around people &amp; impact. And this is what I want to do. This is what I have been trying to do. Have an impact on people's lives. Wherever I live, wherever I go, whoever I cross paths with. In return for my selfish pride and preparing for eternal truth. I can tell you I have been doing decently good at it. I have been able to touch &amp; inspire a few souls. Have tried a bunch of things in pursuit. It is a lifelong project, after all. This is where I stand. You got the answer finally. 🕺</p>\n<p>It must be 3 minutes already. It is going to be a long read. And I am intentionally keeping it more abstract in the beginning. I don't want people to read actual stuff. I want them to drop off before they read the actual stuff. I am an introvert, as I said already. Even if you read, I don't want to answer anything concrete in follow-ups. I am always on for going abstract and more philosophical conversations. </p>\n<p>Another filler line after a filler paragraph. I am 28, and in my mind, I am jumping into my 30s. Just 2 years in my 20s, so I should start preparing. I am betting on my good habits to be equally productive at 60. What's the point of physical, mental &amp; nutritional attention, what's the point of living remotely in a village, never touching alcohol, even no caffeine if not. This means I have optimistically 30 years of having peak impact. These are pointless numbers why am I bringing them up? I wanted to start up a few months ago. I explored a few ideas and domains. The answer to what I wanted to do - has always been to have an impact on first-degree people's lives. But startups are a wealth creation tool, not necessarily first-degree people's impact. Then why not NGOs? I wanted to start-up to create wealth. Wealth enables impact; It can enable NGOs, can't it? If 20's was the knowledge accumulation time, 30's is the wealth and leverage creation phase. My bet is to compound all of it in the '40s and have a massive impact in the 50s and '60s and compound just on impact &amp; leave it here in the latter half of life. </p>\n<p>This is the horizon I am looking at, from knowledge to wealth creation/accumulation. Knowledge accumulation should be passive and continuous. We learn to stand, and then we learn to walk. Standing becomes passive even when we continue learning sprints, long jumps. That's how compounding works. The horizon I am looking at requires taking bets, thinking bets, and winning bets. It is a game of delicate thinking &amp; execution - smart work some people say. I am bad at giving references, but I want to get better in 2025. It is also a game of luck. But <strong>luck, as I define it, isn't such a miracle. </strong></p>\n<p>If you are still here, I wish you a very good new year. I know we all are in a fight. Each new cycle will make you more powerful and wiser to keep fighting, and till you keep fighting, it is your game. <strong>Luck will come your way, and you will bend it to your will, as I said, Luck isn't such a miracle. </strong></p>",
            "image": "https://www.thebstar.com/blogs/media/posts/21/Screenshot-2024-12-30-at-10.58.01-PM.png",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
                   "life"
            ],
            "date_published": "2024-12-30T22:57:01+05:30",
            "date_modified": "2024-12-30T23:28:42+05:30"
        }
    ]
}
