{
    "version": "https://jsonfeed.org/version/1",
    "title": "Thebstar blogs",
    "description": "",
    "home_page_url": "https://www.thebstar.com/blogs",
    "feed_url": "https://www.thebstar.com/blogs/feed.json",
    "user_comment": "",
    "author": {
        "name": "Bikram Sutar"
    },
    "items": [
        {
            "id": "https://www.thebstar.com/blogs/the-2025.html",
            "url": "https://www.thebstar.com/blogs/the-2025.html",
            "title": "The 2025 wrap ✍",
            "summary": "Let's do the yearly review. Please put a review of the year shamelessly if you are going to plan the next year. And if you want the plan to work. It is an accountability mechanism. When you have a decent checklist ticked, it is a&hellip;",
            "content_html": "<p>Let's do the yearly review. Please put a review of the year shamelessly if you are going to plan the next year. And if you want the plan to work. It is an accountability mechanism. When you have a decent checklist ticked, it is a way to celebrate. 🎉</p>\n<p>I wanted 2025 to be themed around health, leverage, and knowledge. Social activity was a bonus. <a href=\"https://www.thebstar.com/blogs/what-can-i-get-done-52-week-sprints-2025.html\">You can read this for a week-by-week progress</a>. Here I am gonna share reflections per theme and share major highlights.</p>\n<h2><strong>Reflections</strong></h2>\n<ul>\n<li>Health - 8 out of 10\n<ul>\n<li>Wanted to run 22 min 5k, 52 min 10k.\n<ul>\n<li>Did a 22:30 5k, 52min 10k.</li>\n<li>Got injured later. So couldn't tick 22 min 5k</li>\n<li>7/10</li>\n</ul>\n</li>\n<li>Wanted to have abs 😅\n<ul>\n<li>I have a 4 pack 🎉. </li>\n<li>8/10</li>\n</ul>\n</li>\n<li>Bonus\n<ul>\n<li>Got injured and recovered so fast. </li>\n<li>Recovery is the best sign of fitness. 💪</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Leverage - 3 out of 10<br>\n<ul>\n<li>I wanted to start having a passive income. Didn't happen. 0\n<ul>\n<li>But I actually initiated a few ideas. Did some actual effort here. Maybe I have done the groundwork.</li>\n<li>I am very process-oriented, and sometimes I don't count results, but here I am rating myself for results, hence 0.  </li>\n</ul>\n</li>\n<li>I wanted to have low liquidity, around 20%. I have 30%. So a 0</li>\n<li>I wanted to do a lot of writeups and builds\n<ul>\n<li>I did a decent no of writeups, mostly personal - 4/10 </li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Knowledge - 7 out of 10\n<ul>\n<li>Did a good no of builds 6 / 10\n<ul>\n<li>Won a hackathon at work. </li>\n<li>I am constantly in the top 20, sometimes top 10 or 5 in terms of AI usage in a 300-person org. I will take this.</li>\n</ul>\n</li>\n<li>Learnt Sanskrit - 5 / 10\n<ul>\n<li>I can read, I can understand the subject, object. Need to learn more tenses and words. And practice. </li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Bonus - 8 out of 10\n<ul>\n<li>I wanted to score a 50 in a match, ticked this. </li>\n<li>I had decided to move away from social positions; I have done this.</li>\n<li>I wanted to have an impact at the individual level, 5 people, I have done 4. </li>\n<li>I would have liked to spend a little more from my social budget. I haven't even touched 1%. This is a negative. I was conscious about this in December and put in my efforts in giving. </li>\n</ul>\n</li>\n</ul>\n<h2>Highlights</h2>\n<p>The following are the major highlights that I remember. Some of them are things I wanted to do, some of them happened and resulted in some good impact - </p>\n<p><strong>Work</strong></p>\n<p>I was part of a winning team at a hackathon at work. This makes it the second successive year of winning at least one hackathon. </p>\n<p>I wanted to switch my team and move on to more horizontal impact work. I switched to data viz that is going to be used by all products inside LaunchDarkly. </p>\n<p><strong>The SF trip brought clarity</strong></p>\n<p>I was in SF at the start of the year and saw 500 people in a room. Saw how big organisations organize these events. Saw how a trained CEO or any senior leader brings in clarity. 1. They show you a clear vision, and 2. They have very clear steps to the vision. 3. If each step is trackable, it is going to be more effective. I have been practicing it. This was my takeaway from the trip. Yeah, the city was beautiful. And probably one of the cities I won't mind living in for a long time.</p>\n<p><strong>A dull month</strong></p>\n<p>It is rare for me to have a dull month. But I had a few. It was probably around March, I started talking to someone. And I surrendered to the idea of getting married. I surrendered and said Whatever it is, I am gonna make it work. She was very pretty, maybe the prettiest, and very innocent. Maybe the most innocent girl I have met to date, in this case. But something wasn't clicking. I was dragging it.</p>\n<p>In July (🤔), I was in Kolkata. I was reflecting on whether I should continue. I visited a few places - the Botanical Garden, the Indian Museum. I got a message from a friend (now a friend) out of nowhere. Sometimes people can do so much to you without them knowing. She did that to me. I received her message. Replied to her. Immediately, Wrote a message to the girl above. We had a call later, and I let her know how/why I felt it wasn't going to work. Because of this friend (SA), I was able to drop the baggage, I felt lighter, back on my feet. I owe her a big thank you and a big gratitude message 🙇</p>\n<p>I might have walked away from above at some point, as I know myself. Or maybe not because I had surrendered. I don't know. But SA made it happen real quick for me. Never a dull moment in life. This brought me a different kind of clarity. I have been carrying it; it contributed to my life outside as well. A marker is that my cricket, running, and fitness have improved. Maybe my work too, but I take work religiously, hence it would go well irrespective of outside life. </p>\n<p>Edit: Hold your horses, my friend. Nothing special here. </p>\n<p><strong>Hit a peak</strong></p>\n<p>I thought people would slow down in their 30s. And I had in some sense started to slow down. But around Dussera, I hit a peak. I am in a flow state after that. I have a lot of energy. Mentally physically. Above is one contributor, maybe. And 2nd was that I found more impactful work. I feel like I am in my early 20s. Even when I get injured, I recover so fast. ⚡ Since I have tasted this, I am not gonna go back. </p>\n<p><strong>More than words, intention matters</strong></p>\n<p>I am reading Gandhiji's autobiography. He mentions how words can be misused, misdirected to convey different meanings. But when you promise, when you make a pact to be true, you should be true to the intention. This has hit me. I am going to be true to my intentions more to others. To myself, I am gonna make sure that while setting goals, I don't leave room for different meanings. </p>\n<p><strong>Chaos to settle</strong></p>\n<p>Expectedly, I am ending the year with more chaos and more uncertainty. I have the next few weeks before I lock in 2026. Chaos should settle, and the execution should take over. It is okay to have chaos if execution continues to be excellent. </p>\n<p><strong>Fun</strong></p>\n<p>2025 was fun. Khushi (sister in law) got transferred. I have a sister at home. Everyone is happy. A lot of friends got married. Danced a lot 😅. Now they say it is on us! It isn't happening soon. Who knows. </p>\n<p><a href=\"https://youtu.be/hmgt6FLy9aI?si=DHDxrg2SHoiHusHR\">Made some videos</a>. </p>\n<p>26th is my birthday, and I have gotten a jersey that says 26 😅. So it is gonna be a fun year next. Have fun 🎉</p>\n<p> </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-12-30T10:14:51+05:30",
            "date_modified": "2025-12-30T11:45:05+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/random-monologue-on-manifestation.html",
            "url": "https://www.thebstar.com/blogs/random-monologue-on-manifestation.html",
            "title": "Random monologue on manifestation",
            "summary": "It is an absolutely nonsensical, crazy piece. Read at your own risk. I am just journaling. I have mentioned many times to people that I manifest good energy for myself. It is very true. I feel I have manifested many things, many moments. All good.",
            "content_html": "<p>It is an absolutely nonsensical, crazy piece. Read at your own risk. I am just journaling. </p>\n<p>I have mentioned many times to people that I manifest good energy for myself. It is very true. I feel I have manifested many things, many moments. All good. Mostly good. The 23rd of December 2025 sparked a different thought. Capturing it here, in case I come to this again. </p>\n<p>I saw an accident while returning from cricket practice. I helped the victim to the hospital. He is fine now. If I do any manifestation, I manifest good things, I manifest being good, being useful, I manifest being resourceful. I manifest being helpful. Hear me out, if I am manifesting my reality, is there a possibility I am manifesting these scenes subconsciously, so I can be helpful?</p>\n<p>I prefer enablement over on-demand help. But even then, there is a feeling of being useful in being helpful. This is more reactive, low-hanging than enablement. Success in helping is more controlled, more defined. Many factors go out of hand in enablement. </p>\n<p>Sounds like borderline craziness. But let's not think I will be helpful. I shall still be open to help. Not seeking to help. Would this change no of scenes I see? If it doesn't, would it be because I will manifest less, or would it be because my body will somehow give it away?</p>\n<p>Cray! Good that I don't do this actively, all happens unconsciously, and I just get a spark for a second. Usually, they are useful. Sometimes they are as crazy as this. Again, good that nothing is active. Almost like I can give instructions to unconsciousness and it executes. So I can be somewhat sane actively. </p>\n<p>Time to hit the bed. Exciting days. I am in a PTO and doing fun stuff. </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-12-25T00:33:06+05:30",
            "date_modified": "2025-12-25T00:35:19+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/i-speak-of-probabilities.html",
            "url": "https://www.thebstar.com/blogs/i-speak-of-probabilities.html",
            "title": "I speak of probabilities!",
            "summary": "I have evolved a lot. It feels like a good checkpoint to explain the concept of nothingness. It is my own opinion of nothingness. It is maybe my ideal model of nothingness. It doesn't mean I am capable of practicing everything I am going to&hellip;",
            "content_html": "<p>I have evolved a lot. It feels like a good checkpoint to explain the concept of nothingness. It is my own opinion of nothingness. It is maybe my ideal model of nothingness. It doesn't mean I am capable of practicing everything I am going to say here. </p>\n<p><strong>Life probably has no meaning</strong></p>\n<p>It is hard to imagine this, life running without meaning. We are the lone conscious species in the universe that we know of. Feels like an extremely unlikely random event. How can we exist without meaning? </p>\n<p><strong>I speak of probabilities</strong></p>\n<p>If I recall, in 2020, I started realizing, I don't control everything. Even for the simplest of actions/explanations, it is impossible to be 100% certain. I would like to argue, I can be close to 100% certain. And from my limited pov, I can be closer to 100%. And I have, for simplicity, consciously used certainty instead of confusing people. How can I predict certainty when I am uncertainly uncertain?</p>\n<p><strong>Life probably has a meaning</strong></p>\n<p>Contrary to what I said earlier, maybe life has a meaning.  Each of our lives. This is a much easier and natural way of living. Maybe more harmony in this. Maybe it doesn't require extreme detachment to still live peacefully, and keep making progress where we don't know the road. </p>\n<p><strong>The meaning of life</strong></p>\n<p>Why do you need the meaning of life? What is the most atomic question we are trying to answer? Who am I? Before asking why am I? Maybe it is easy to answer who I am. Maybe both questions/answers supplement/complete each other. The most important thing here is \"I\". </p>\n<p><strong>\"I\" is the consciousness</strong></p>\n<p>Dig deeper into the eye. Connect with it. Embrace it. \"I\" is you; it is within. Most of us operate from a very shallow surface of \"I\". We only know the tip of the iceberg. Once we have enough activated consciousness, maybe our answer to life will start appearing. Maybe we will learn to ask the right questions. </p>\n<p><strong>Why does it matter?</strong></p>\n<p>Does it really matter if life has a meaning? If life is so random, my occurrence in life is unfathomably random, and so my consciousness, and everything that matters. Maybe finding these atomic units is gonna connect to the big picture. </p>\n<p>There are two possibilities - life is planned, or life is random. If life is intended (which we ignored earlier), anyway, everything matters. Focusing on consciousness is still gonna lead us individually. If it is random, everything ends in nothingness, most likely. </p>\n<p>Be because you want to, be because you must. Because you can't be anything else. </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-12-25T00:11:47+05:30",
            "date_modified": "2025-12-30T10:07:26+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-declaration-of-december.html",
            "url": "https://www.thebstar.com/blogs/the-declaration-of-december.html",
            "title": "The declaration of December",
            "summary": "It is December again. In a way, for people old enough, it's time to circulate those \"Happy New Year in advance\" messages 😅. And for grumpy people, it is the time to wonder what exactly to be happy about another round of the sun. Isn't&hellip;",
            "content_html": "<p>It is December again. In a way, for people old enough, it's time to circulate those \"Happy New Year in advance\" messages 😅. And for grumpy people, it is the time to wonder what exactly to be happy about another round of the sun. Isn't it just a completely random point in time and space? I will leave that conversation to those groups fighting for it. I wish a beautiful Christmas to people who celebrate. Who doesn't and can afford a small reset, let it be. For me, it is a month to double on my goals. And finish the year strong. </p>\n<p>In an infinitely long timeline (barely a few thousand years that we remember and maybe another few thousand before we disappear), there must be markers to rest, reset, push, drive, go crazy, and sometimes celebrate. Markers to remember and revisit. The calendar is probably humans' first ever time machine. I'm not sure if it is natural, because when I think of going back, I think of moments, not dates. Some people recall moments by dates, but I doubt that is intuitive, without reasoning, for most. </p>\n<p>Let me crank the time machine and go to the start of the year. Let me revisit the goals - </p>\n<ol>\n<li>I wanted to have visible abs and take a photo by year's end</li>\n<li>I wanted to learn Sanskrit</li>\n<li>I wanted to do a lot of builds</li>\n</ol>\n<p>I have made progress on all fronts. 3 is a continuous item. I am going to focus on 2, and judge myself this month on whether I can do them or not. I am back to my preset, and <strong>this is the declaration - </strong></p>\n<ol>\n<li>I want to have abs and take a photo. I am in the best shape, and this is the best time to do this.</li>\n<li>I want to record a small video on Sanskrit. As proof. </li>\n<li>I want to recover completely from the sprain. And do my first run to celebrate the new year. </li>\n</ol>\n<p>I had planned to do a lot of running, short intervals, and do a high-calorie deficit diet to lose fat. I am in good shape. Losing 3/4kgs and a heavy focus on core would have been enough, I thought. I twisted my ankle yesterday. And from the looks of it, it will take 3/4 weeks to recover. I can't run. I walk with discomfort. I will have to find another way to achieve the same results. The good thing is I can't play cricket, so I don't have to go outside. I can be invisible at home. And lock in for December. </p>\n<p>It is gonna be fun, this is one of the most exciting Decembers. Great things await on the other side. Happy new year in advance 🤣</p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-12-01T06:36:59+05:30",
            "date_modified": "2025-12-01T06:36:59+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/2026-manifesto.html",
            "url": "https://www.thebstar.com/blogs/2026-manifesto.html",
            "title": "2026 Manifesto ",
            "summary": "21st of November There are plenty of options, among everything I choose you. There were options, and there will be. If anything, 2026 is the year I want to try my luck at building something new. There are probably two big priorities in life. Probably&hellip;",
            "content_html": "<p><strong>21st of November</strong></p>\n<blockquote>\n<p>There are plenty of options, among everything I choose you. </p>\n</blockquote>\n<p>There were options, and there will be. If anything, 2026 is the year I want to try my luck at building something new. There are probably two big priorities in life. Probably only one when I look at things from purely my own lens. I want to build something great. Something useful, something that creates value. I was saying the same things last year. Didn't do. Got settled into a job, to be honest. I have been doing great at my job. But probably not the best work of my life. </p>\n<p>To have the best chances, I need to widen my net. I need to be doing many things until I hit something. I need to find people, circles who are on the journey. I need to figure, whether I need to be physically somewhere or run everything virtually from home. I shouldn't let the comfort of home stop me. </p>\n<p>The other big priority in life, at this stage, is getting married. Although I still believe I don't need to rush. The family seems to be in a rush. This year, if anything, I should find someone. Loud and clear. I don't know if two things can run in parallel. If I find the right people and crack this, life will be so good. </p>\n<p>I want to keep my health running on autopilot, leaner, faster, fitter, and peaceful me. </p>\n<p>Financially, I want to do well in the first half. I don't know what I will end up doing in the 2nd half. I won't be on a paycheck. <span style=\"text-decoration: line-through;\">I had to decide this. I have decided. This is the time</span>. (22nd December update)</p>\n<p>I would love to have a hobby and learn a musical instrument. And continue playing some cricket. But I don't know. I want the work of my lifetime to be good. Efforts so good that when I fail, I can look at myself and smile. </p>\n<p>Note: This is still raw. I will let it cook. I might still do a job, but that should be the last step towards building my own thing. FDE, Sales Engg, AI Engg, etc, are the roles I will be interested in. Let's see 🤞</p>\n<p><strong>22nd of December</strong></p>\n<p>I have half-built an AI cricket coach. I have a working pipeline, need to producctionize it. I built a useless macOS app to light up faces in calls, yes, it is a ring light. I have done meaningful work at LD. Have been instrumental in shared dataviz. Maybe there is a space in the AI config I can explore for a few months. </p>\n<p>I have taken a long break in December. 22nd to 1st of Jan. Actual off started on 21st of December (Saturday). This has made me realize I can maybe still have a job and iteration on a few ideas inside. Have jobs as options and pick the most fun option; the other dimension being finances. </p>\n<p> </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-11-21T23:18:01+05:30",
            "date_modified": "2025-12-24T23:29:15+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/the-old-soul.html",
            "url": "https://www.thebstar.com/blogs/the-old-soul.html",
            "title": "The old soul &amp; the cages",
            "summary": "I didn't know there was a test match going on yesterday (14th Nov, 2025). I barely watch cricket these days. I still follow it a bit. I opened Hotstar out of temptation and watched a few overs. I don't exactly remember the details, but I&hellip;",
            "content_html": "<p>I didn't know there was a test match going on yesterday (14th Nov, 2025). I barely watch cricket these days. I still follow it a bit. I opened Hotstar out of temptation and watched a few overs. I don't exactly remember the details, but I know SA got all out and India came to bat. The day ended early due to bad light. I don't recall the details because I was multitasking. I was working and watching the match passively. I am not good at passively consuming something. I know people who are really good at this. And I had some thoughts running at the same time. </p>\n<p>I am an old soul. In the age of T20 cricket and all the glaze, I prefer test matches.  In the age of show and making loud noises, I prefer being sustained and silent. Don't get me wrong, I am every bit opposite to what a traditionalist would be. I don't follow structures; I don't follow institutions for the sake of it. I am on my deathbed, have no chances of surviving, and you give me a way out, even in that situation, you will find me asking why, how? A simple answer like trust me would be enough if I <strong>could</strong> trust you. </p>\n<p>I am so free, I do everything that makes sense to me, everything that seems interesting. I am so free, yet I am in a <strong>cage</strong> of my own. Multiple cages, actually. Okay, they aren't cages; they are boundaries set by me, for my core. For the values, for me. Cage may be an oversimplification. Easy for other people to understand. Maybe they are cages, and I can't help to get out. I can't get out. Better, I don't want to get out. I would know there is a socially better outcome outside of these cages, but I can't help. I am never sold to social outcomes; I want to fly, but in my own free world. I am free when I know I haven't twisted, played with my values. Most free versions are the ones that don't even need to <strong>unsee</strong>. And irony, I have been blessed to <strong>see</strong>. </p>\n<p>To be continued...</p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-11-15T09:45:58+05:30",
            "date_modified": "2025-11-15T09:46:09+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/musings-2.html",
            "url": "https://www.thebstar.com/blogs/musings-2.html",
            "title": "Musings",
            "summary": "Today, October 23, 2025, is Bhai Tika. We, the people of the Nepali community, celebrate bhai tika on the last day of the Tihar festivals. Sisters put a seven-colour tika on the brother's forehead. Praying for their long life and prosperity. There are many such&hellip;",
            "content_html": "<p>Today, October 23, 2025, is Bhai Tika. We, the people of the Nepali community, celebrate bhai tika on the last day of the Tihar festivals. Sisters put a seven-colour tika on the brother's forehead. Praying for their long life and prosperity. There are many such festivals in our community, celebrating the bond between brothers and sisters. </p>\n<p>I am not religious. And a lot of our festivals are very strongly tied to religions. Although some new age people try to find a different meaning and decouple festivals and religions. Maybe they should be separated, but every ritual there carries such significance; not sure if they can be separated. And a lot of rituals in festivals are actually rooted in nature worship, so not sure if they should be separated. Coming back to festivals, as I said, I am not religious. But I like all festivals. And as I live with people who deeply believe in religions, I try to follow all rituals, all sane rituals associated with the relevant festival. Festivals are wonderful ways to celebrate life, bonds, and experiences. They are wonderful to stop, be grateful, appreciate, and celebrate life. Life itself is so worthwhile that, should be celebrated every day. I feel grateful to be living, I feel joyous, I feel spirited, I feel loved, I feel loved, I feel cared for. I feel connections, I feel people around me, I miss the people who left, and I am excited for new people to come and join. It is an endless journey that I am part of. I feel humbled, meaningful, and at peace. Every celebration is the feeding of this positivity to my brain. It is the required nutrition for the brain to churn out more positivity. It is the fuel to manifest a similar reality. </p>\n<p>If I have to visualize my writing, they are never a straight line. So is life, and so our thoughts. Maybe I will structure them if I ever plan to write a book. I don't know. Should I structure them? As long as I am raw, and people have access to thoughts flowing (original versions), I don't have a problem in making them more accessible. Communication is about relay, then telling. But this is my space. My musings. I don't need to be structured. I can open my editor and start writing. I can start dumping. I know where I am going, or sometimes I know a point in a journey, the journey itself is unravelled in the musings. Sometimes, I have a destination and clear starting points as well. But for now, it is a point in time. </p>\n<p>For the last few years, since Jaya has been here (She is my maternal uncle's daughter), she and Tulshi (My paternal uncle's daughter), both in class 11th, 9th now, have been celebrating Rakhi and Bhai tika with a lot of enthusiasm. I feel so elated. Enthusiasm is infectious. I am also infected, what can I say? I celebrated bhai tika with them early in the morning. My mom was heading to her parents' house, father was heading to his sister's house.  Tulshi was heading to her maternal uncle's home. It was decided that the Tika will be celebrated early in the morning at home. This also allowed me to visit my paternal uncle's daughters. They had been inviting me to tika for some time, and I couldn't refuse. Around 10 am, I took my bike out. cleaned it up and headed to their place, a 50km journey. </p>\n<p>24th Oct 2025</p>\n<p>I like riding a bike. Gives me the perfect thrill. There was a time I used to think 2-wheelers are risky, but that was a long time ago. Now, it almost feels like an extension of the body. I feel the gusting wind hitting all over the body, engine thumping, heart pumping more blood, and a rush. The power while overtaking. I started my ride. And was soaking in the feel. On the highway, when I was trying to overtake a truck, the driver spat out Gutkha. It was on my forehead &amp; on my arms. I tried stopping the truck, truck ignored me the first time. But I caught up. Near a speed breaker, I had a chat with the driver. I asked him not to spit like that. He initially said he didn't see me and later apologized. And I carried on. It wasn't a heated conversation. In these kinds of situations, it can very well be a heated conversation. I have started to not pick these small fights that aren't worth it. If I can't change something, is it really worth a fight? The only thing I wanted to change was letting him know I was upset and that he could do better. Hope he does better. In game theory, maybe it is tit for tat with a little forgiveness. And he was a first-time offender. Life goes on. </p>\n<p>Tika was good. At home, I enjoyed it a lot. And at the uncle's place, I enjoyed it equally. I had 3 nieces there, and I enjoyed playing with them a lot. We did a role play, I was their son, a student, and they were preparing me for school and teaching me alphabet sounds in school. I was heading back home, thinking everything balances out, I had a good start, and then the bad incidents. Imagine you being ready, and blushing, and someone spits at you. And then, I had a good time again. I was riding back. A truck again almost hit me. This time, the truck was overtaking another truck, and there was an auto in front of me. Auto turned left to give way to the truck, truck wasn't visible to me initially. I managed to move to the left just in time. Lucky me. Oh, I also met a school batchmate after a really long time, close to my uncle's place, out of nowhere. That was a good time too. </p>\n<p>I was attending <a href=\"https://en.wikipedia.org/wiki/Deusi/Bhailo\">Deusi</a> in the evening when I got a sudden call from my manager. I was on vacation. He called me to congratulate me on a due increment that we were discussing for some time. It finally went through, and from November, it will reflect on my payroll. Well, life truly balances everything out. And there is beauty in seeing the balance. To top this, I then had a really long conversation with a teen from my village, intensely long, like 2/2.5 hours. I had to drop him home later in midnight. At 12 am, I was heading back home on an empty road, some deusi sounds echoing from far. First time I experienced midnight without even 1% of fear. I used to be out at midnight in complete darkness, but I used to have supernatural fear, at least some slight fear somewhere inside. I slept around 1:30 am. A good long day. </p>\n<p>I started with many thoughts yesterday, but I don't feel like completing them all today. One thing I feel is important and I am gonna share is, the last couple of weeks leading to Diwali, I feel so active, so pumped, I shared on the journal, on Twitter, and a few folks. I was finding the reason. The week before Diwali, it was again 3 days of pure power and 3 days of not so much. The days when I felt it were the days that were the most chaotic. Those were the days I had to wake up early and sleep late. And I had challenges in the day. So, chaos on my plate seems like the fuel for the energy. I don't know how sustainable. I don't know if there can be a balance between chaos and peace. I had tried finding the peace and keeping myself super motivated earlier. I am gonna try balancing chaos with peace. Let's see how it goes. I am gonna create busy, packed schedules, and a schedule that I love. </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-10-24T08:55:19+05:30",
            "date_modified": "2025-10-24T08:55:19+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/post-dussehra-run.html",
            "url": "https://www.thebstar.com/blogs/post-dussehra-run.html",
            "title": "Post Dussehra Run",
            "summary": "I have consumed a lot of sugar this week. This was the week of Dussehra. I am using the past tense as it is almost over now. Dussehra in Assam was somewhat subdued this year. I had a very low, not much-moving week. Not everything&hellip;",
            "content_html": "<p>I have consumed a lot of sugar this week. This was the week of Dussehra. I am using the past tense as it is almost over now. Dussehra in Assam was somewhat subdued this year. I had a very low, not much-moving week.</p>\n<p>Not everything was dull. Let me catch you up with the good parts. During the last half, we organised a few games for kids. Even adults participated, and we had to let them play. For the last 3 years, we have been organising games during Dussehra. It is a new addition to the already happening 3 days of packed celebrations. Went to a few places. Eaten a lot. Visited relatives to take their blessings. Other people visited for the same reason. Walked ~6km to say goodbye to the Durga idol for the immersion. </p>\n<p>I managed to do a few runs in between. I read a few chapters from Bhagat Singh's letters, Gandhi's biography, and a book on sales. Thanks to Div for recommending the sales book. </p>\n<p>And 🥁, I learnt to play the dhol, well, I just know 2 or 2.5 beats. But that counts, right, from not knowing anything. I can play it now. I am shameless, overconfident, and relentless when it comes to learning new things, and very curious. I had a lot of fun figuring it out on my own. No one was teaching me. My uncle said, Just keep beating it and you will figure it out. I followed the same, maybe he was actually teaching me. </p>\n<p>It sounds like a lot of fun to pack within 5 days. So, why did I start with this Dussehra being dull? Well, I missed my brother. I wanted to tease him when I was playing the dhol. I wanted him to be with me for the 6km immersion walk. I wanted him to be on my side when we visited relatives. He is the one supposed to be enjoying all this. I live moments, but I am not the one to enjoy all this. I am not to enjoy all this without him. I want others to experience, and that gives me joy.</p>\n<p>Continuing on the above lines, one of my friends mentioned she felt alone this puja. Also, she had to take up a lot of work at home, but she felt dull and missed friends. This was day 2, and that kept reminding me of my brother. On my friend feeling alone, we used to have a lot of activities, covering time around puja, she used to be involved in almost all those events must have covered for her friends. I don't think she actually has a friend here. As I wrote the last line, I feel the gravity of the sentence. She is in her 30s already, well settled. Maybe it is time for her to get married, I keep teasing her this 😄</p>\n<p>There was a famous meme circling - \"cameraman focus karo\", which reads - \"cameraman focus on the subject\". I felt sharing as I focused back on myself. I woke up early, Yay 🕺 I have gotten so better at waking up on my schedule. I woke up early and went for a run after a few stretches. I ran for 2km, and my calf and ankle were in pain. I had planned to run 8km, but stopped at 2.8km. That's just 35%. But I felt like I couldn't walk. Stopped my tracker, walked into my room, lay down, and did a long stretching session. </p>\n<p>I have been used to this running feeling. Sometimes it feels so tough. Sometimes it just flows. Well, I can reason and find triggers. It happens to be a bad day for me in running. On face value, there are good days and there are bad days. Each bad day reminds me there will be more bad days. The worst days, and there will be a stretch of those days. I shall be prepared, and you know, to have a good average, I shall double down on good days. I shouldn't let good days go at a discount. I shall turn the good days into the best days. Pretty much how and why we do savings. </p>\n<p>Earn enough and a bit more, save a bit more on good days. There will be bad days, and on bad days, try not to turn them into the worst days.</p>\n<p>Wishing it's a good day. </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-10-05T09:33:47+05:30",
            "date_modified": "2025-10-05T09:33:47+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/self-aware-we-all-are-arent-we.html",
            "url": "https://www.thebstar.com/blogs/self-aware-we-all-are-arent-we.html",
            "title": "Self aware - we all are, aren&#x27;t we! ",
            "summary": "11:53 PM, Wednesday, September 2025, I am writing this after a reflective conversation with a friend. Emotional intelligence, self-awareness, all this jargon gets thrown around a lot these days. What are they really? And why should you care? And who am I to write about&hellip;",
            "content_html": "<p>11:53 PM, Wednesday, September 2025, I am writing this after a reflective conversation with a friend. Emotional intelligence, self-awareness, all this jargon gets thrown around a lot these days. What are they really? And why should you care? And who am I to write about these? And why should you read this?</p>\n<p>Let me start with the last question: why should you read this? Everyone gets a $20 Amazon voucher at the end. Kidding. <strong>I will give you simple steps to have magical connections with people</strong>. If people tell/complain to you about the following, you should read -</p>\n<ul>\n<li>You aren't aware - self-aware, emotionally aware, socially aware, etc.</li>\n<li>You don't listen to me</li>\n<li>You don't get me</li>\n<li>You don't tell me, you don't open up, I don't understand you</li>\n<li>You don't ask me questions</li>\n<li>You don't have time for me</li>\n<li>I can't trust you, I don't believe you</li>\n<li>And so on. </li>\n</ul>\n<p>Let's start with who am I? I am rated decently on the EQ scale, based on the people I have had interactions with, and they are highly rated for their EQ in the social circle. These are mostly successful founders or executives in the tech world. I am also connected to random strangers, listening to their life stories and sharing some of mine. I can't stop; there is another jargon I can throw here. But let me save that for later, this article anyway is gonna be long, hence no digression or twist. </p>\n<p>I said no twist, hence let me make the context very clear upfront. Or you won't trust me, right? 😄. </p>\n<ol>\n<li>If you had asked any of the above people about my EQ, let's say 15 years ago, they would have rated me very pathetically.  </li>\n<li>Interestingly, I would have still rated myself very high. </li>\n</ol>\n<p>To make it easier to understand both 1 &amp; 2, let me define what EQ and/or self-awareness really are. I don't follow textbooks; please bear with me. </p>\n<h3>Self awareness</h3>\n<p>Let's start with this. Let's start very simply. Every living thing that knows of its existence is self-aware. It is a very broad definition. For this conversation, let's stick to Humans. Every mentally healthy human being is self-aware. We know - we exist, we know we are hungry, we know we are angry, <strong>we know we are seen, heard, we are loved</strong>. </p>\n<p>There is more depth to it, but trust me, you don't need to know them yet. They will just complicate things for you. Let's roll for now -</p>\n<blockquote>\n<p>Every mentally healthy human being is self-aware. We know - we exist, we know we are hungry, we know we are angry, <strong>we know we are seen, heard, we are loved</strong>.</p>\n</blockquote>\n<p>We know we are self-aware, but maybe we don't know the way to express this. Or why do we even need to express it?</p>\n<h3>EQ (Emotional Intelligence)</h3>\n<p>Well, EQ is the more quantifiable version of emotional intelligence, easy for comparisons. We humans love comparisons. I will use 'EQ' because it is short &amp; easy. Tell me already, what is it?</p>\n<p>Did you notice something in bold in the last paragraph? \"<strong>We know we are seen, heard, we are loved.\" </strong>- These are the most fundamental needs of us, the humans. And this is what makes us human. We want to be seen, we want to be heard, and we want to be loved. And <strong>EQ is nothing but how much you can make someone feel seen, heard, and loved. </strong>This is why we need to express. I will make them feel that my act is so naive, because we can't always act (in the cliche \"act\" definition), or we can, actually making them feel is an act. Making ourselves feel is an act. </p>\n<blockquote>\n<p>EQ is how much you can make someone feel seen, heard, and loved.</p>\n</blockquote>\n<p>Don't come looking for my address to beat me up. I am gonna share more definitions. What does it mean to be seen, heard, and loved? If people feel seen, heard, and loved, all the above questions will be resolved correctly. I assure you, most of them would be gone. </p>\n<h3>People want to be seen</h3>\n<p>People want to be seen. They want you to notice them. We humans are so expressive. Even the most poker-faced people, even the most introverted people, want to be seen. You can't disagree. Please don't. Or how else would you explain walking up late, not having a good sleep, or having less energy on bad days? How would you explain your tone changing in conversations? How would you explain your leaning to people? And what about your eyes - pupils? We want to express. We are storytellers. And we want to be seen. </p>\n<p>We want people to notice, notice the phases we are going through. Notice the bad day we are having. Notice the new dress we got. Those restaurants, family shops want you to notice their great-grandparents, who would have the pictures of them hanging on the main wall. </p>\n<p>Or why else did we put Mahatma Gandhi's picture in the note? Why do we give people Bharat Ranta or the Nobel Prize?</p>\n<p>We want ot be seen. Ask honestly, ask with an empty mind - imagine one fine morning you woke up, had a really good day. You are all happy and in a good mood (because your body wants to be seen). You want to tell it to someone. And your loved ones, family, ask, \"You look so happy today\". </p>\n<p>We want others to notice this. Down shoulders, energy level, tone, mood - if you want to call it. How we react, how we act. We want others to see our emotions. <strong>But why?</strong></p>\n<h3>Why do we want to be seen? We want to be heard</h3>\n<p>Yes, we want to be seen, because we want to be heard. We are storytellers. Evolved over a thousand years in close setup, in groups, and civilizations. We want to be relatable, we want to be listened to, we want to feel understood, we want people to empathize, we want to share happiness, we want to find hope...</p>\n<p>If being seen is important, it is 10x more important to be heard. We can walk alone in a crowd, knowing no one will see us; we just need one person who makes us feel we are heard. Isn't it better to have a lot of people who make us feel seen, heard, and we do the same for them? If all of these relate, do share this with your friend. Maybe this is the only article that is written on my blog for sharing. </p>\n<p>We want to be heard because it makes us feel we are not alone; we are part of something. And when I say \"heard\", I mean understanding me. We want to feel understood. And act if/what is possible in their capacity. It isn't always possible to act. </p>\n<p>Have you seen a baby cry? Infants, when they start growing up, close to 8/9 months, they start identifying objects. But they still don't understand that things can exist outside of their vision.  They cry, not seeing Momy, because they don't yet have the perception that Momy can exist even when she isn't in their sight. And when they see mommy, they want to go to her, because she knows them. She understands her crying. They don't have a language, but they still express, they still want to be seen. And they feel so good, because they feel heard. <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC5330336/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Success, happiness in the later part of life is so much connected with how deep their bonds are, how much they had to cry before someone cared for them. </a></p>\n<h3>Isn't this love? We want to feel loved</h3>\n<p>We want to feel seen, heard, trusted, respected, and cared for. If we get these, this is what love is. The mixture will look different in different stages of life. But you know all of these just compound over time. And if we practice seeing, hearing, and with respect, trust, and a bit of action and care, love is the beautiful result. It isn't magic. If this mixture doesn't fit well, if any of these vectors are disrupted repeatedly, the feeling of love will start to fade. It is one thing to feel loved; it is another to make someone feel loved. Both are magical, out of this world. I can talk about consciousness and out-of-the-world feeling more. But you would already be yelling at me. Hence, let me give you easy tricks to practice seeing and hearing. </p>\n<h3>Last stop before the destination, Communication is a multi-step funnel</h3>\n<p>Please bear with me for a few minutes, and I will hand you the tricks. It is important to understand that communication is a multi-step process. And in each step, there is a huge drop-off involved. Have you been to any public events? You see 100 people attending the event initially, and by the closing ceremony, there would just be say 40/50 people. And when you are in the organising committee, and you have to clean up the mess, it is just those handful of people. How hard is it to keep all those people in the event till you clean up the place and everyone walks out together? Pretty hard, right? Communication is equally hard. Don't laugh at me. I might be sounding silly. All of us have been communicating since birth, haven't found it hard. Barely any inconvenience, right? Let's set this up.</p>\n<ol>\n<li>You want to say something</li>\n<li>You say something</li>\n<li>The other person listens to something</li>\n<li>They understand something</li>\n</ol>\n<p>1, 2, 3, 4 can all be different. </p>\n<p>You might want to say something, but can't frame it well, can't recall the exact word. So there is a difference between 1 &amp; 2 already. And this is just you. </p>\n<p>Another person might miss a few words, an external disturbance, or their mental state. And they might make a different meaning out of it. Because they are a different person and they have lived different experiences in a different environment. What they listen to and what they understand can look so different. By this time, what you want to say might have come across as something different to this other person. </p>\n<p>This can happen to us as well; what we listen to might be so different than what other people are actually trying to say. </p>\n<p>How do we communicate better, so there is less room for errors? How do we ensure there is minimal drop off? Here we go, the tricks -</p>\n<ol>\n<li>Don't assume anything. If you have any assumptions, lay them clearly. We don't know others' situations, others' lives, and our assumptions will always be incomplete if not wrong. \n<ul>\n<li>Ask questions. If you have assumptions, ask if that assumption is correct. </li>\n</ul>\n</li>\n<li>Listen carefully, give them enough space to talk\n<ul>\n<li>Again, ask questions, but don't just listen to ask questions. Let your curiosity be your guide. There are no stupid questions.</li>\n<li>If you feel like something stupid, personal, say it out loud to people. E.g., this might sound stupid, but I have this thing. And make them comfortable ignoring the thought/question. This will make your life easier, and their life easier if they want to ignore. </li>\n</ul>\n</li>\n<li>Make sure you understand\n<ul>\n<li>Ask clarifying questions. Something like \"..., is this correct, am I understanding this alright?\"</li>\n<li>Summarize to them their own statements. </li>\n<li>If needed, ask for more information,</li>\n<li>Don't assume, ask questions, ask questions</li>\n</ul>\n</li>\n<li>Understand their need\n<ul>\n<li>Are they asking a question? </li>\n<li>Why are they asking? </li>\n<li>You aren't writing an exam. You aren't given an MCQ. </li>\n<li>Ask questions. Answer their questions</li>\n<li><strong>Avoid 1 line replies as much as possible</strong>. </li>\n<li>Give context, tell stories, we are storytellers. </li>\n</ul>\n</li>\n<li>Now it is time to give back\n<ul>\n<li>Make sure you are understood \n<ul>\n<li>Set the context, set the theme, set intentions - with very clear words</li>\n<li>Ask clarifying questions</li>\n<li>Repeat main lines</li>\n<li>Don't give a very long monologue, like this article. 😅</li>\n</ul>\n</li>\n<li>To be understood, give them space to ask questions, give them space to carry on conversations\n<ul>\n<li><strong>It is important for you to feel understood; it is equally important for your close ones to feel, they understand you. Or, they would be kicking themselves every day. </strong></li>\n<li>For the dumbest question like - Hey, did you eat something?\n<ul>\n<li>Think why are they asking? Why are they making fool of them? What would they do with the information?</li>\n<li>Well, because they care. They want to make you feel seen and heard.</li>\n<li>Some answers to the question\n<ul>\n<li>Yes.</li>\n<li>Yes, just ate xy.</li>\n<li>Yes, had xy. Went out to eat after so many days. It was too hot and I didn't feel like getting out of my ac cabin. But I had to see the sun right. I don't regret going out now. Although traffic was bad. But I saw a few kids walking back from school all jumping around. So happy faces. </li>\n</ul>\n</li>\n<li>You know, to anwer like the last anwer you have to see things, notice them, hear them. Trust me you will live more joyfully. </li>\n</ul>\n</li>\n</ul>\n</li>\n<li>If you aren't heard, \n<ul>\n<li>Remind them, Give them reasons\n<ul>\n<li>Let's say you have to get your book back, you had asked them already. Being heard means, being understood. If they didn't do their act, itis time to remind\n<ul>\n<li>Hey, send my book back\n<ul>\n<li>Sounds like you don't trust them. </li>\n</ul>\n</li>\n<li>Hey, send me the book back? Its been a while so I thought of reminding you. \n<ul>\n<li>I kept the first sentence same, intentionally. I added the reason and they now know why I am needing to remind. </li>\n<li>They can reply with something like - I was really busy shifting my house. I am still finding where have I kept it.</li>\n<li>You didn't know, they were shifiting house, be curious, ask where, when did they shift, and if you feel comformtable (why not) ask why did they shift?</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Open up, Share your volunaribilities \n<ul>\n<li>Share how you are also struggling with current landlord. </li>\n<li>This might be an oppotunity find a new house, or a chance to just relate and being heard. </li>\n<li>Sharing volunaribilities doesn't make you weak, instead it makes the connections stronger. People can relate to you more, and they can trust you more. </li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Practice above for a few days actively. Reflect on your conversations and think where you could have given more context, where you could have made others feel more understood. Where you felt seen, heard, loved. </li>\n</ol>\n<h3>Easy self awareness</h3>\n<p>When you feel seen, heard, loved - I want you to ask yourself what made you feel that. </p>\n<p>Let's try </p>\n<p>I felt loved today. Why? Because I met Y. Why? Why did meeting Y made me feel loved? Because Y loves me, cares me? Those are abstract things, I want specific answers, How does Y make me feel loved? Y was so excited to meet me, I felt special. <strong>Well we are somewhere</strong>.</p>\n<p>It is such a good feeling. I want Y to feel this. But hey, did I make Y feel the same?  </p>\n<ul>\n<li>If Yes - well done! Let me tell Y, if I can, I feel so good now. </li>\n<li>If no - I still have time, Let me tell Y, I felt so good after the meeting. And let me try to make the feeling same for Y from next time. </li>\n</ul>\n<p>We are truly self aware now. We don't only know our emotions and states, but we also recognise the triggers. Why it happened in the first place. And we are doing so good with the social, relationship EQ, by relaying this. And making others live lovely. </p>\n<p>I want you to try this for next few days, whenever you sit to eat something -</p>\n<ol>\n<li>I want you to ask - How do I feel now? Why do why I feel so? And follow the above template.\n<ul>\n<li>What can I do better right now, to feel seen, heard and loved?</li>\n</ul>\n</li>\n<li>I want you to ask who is the most important person I met so far today, How did I make them feel? \n<ul>\n<li>Did I make them feel seen, heard, loved?</li>\n<li>If not what can I do now?</li>\n</ul>\n</li>\n</ol>\n<p> </p>\n<h3>Let me summarize, just the tricks</h3>\n<p>To be self aware and rank high on EQ we need feel to be seen, heard and loved. And we need to make others feel seen, heard and loved. We don't need to complicate the world. We need to practice active, no-stupic open communication. We need to constantly listening ot our own feelings, by asking right questions. We need to be listenings others to understand them as much.</p>\n<p><strong>Let me give you two simple tricks </strong></p>\n<p>First, I want you do follow this while sitting to eat, 3 time a day, like a medicine for next 1 week. </p>\n<ol>\n<li>I want you to ask - How do I feel now? Why do why I feel so? And follow the above template.\n<ul>\n<li>What can I do better right now, to feel seen, heard and loved?</li>\n</ul>\n</li>\n<li>I want you to ask who is the most important person I met so far today, How did I make them feel? \n<ul>\n<li>Did I make them feel seen, heard, loved?</li>\n<li>If not what can I do now?</li>\n</ul>\n</li>\n</ol>\n<p>2nd, everyday at night I want you to re-read the 6 communication steps. Keep a counter of how many times you try something from the steps without thinking much in next 1 week. </p>\n<p> </p>\n<p>I want you to re-read this article tomorrow once - just do a brief walk. <strong>Comeback and re-read this article after a week. </strong></p>\n<p>We are storytellers. Self aware, we all are. I want you to feel seen, heard and loved. Take care. </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-09-25T02:17:00+05:30",
            "date_modified": "2025-09-25T02:17:00+05:30"
        },
        {
            "id": "https://www.thebstar.com/blogs/i-recorded-a-video.html",
            "url": "https://www.thebstar.com/blogs/i-recorded-a-video.html",
            "title": "I recorded a video",
            "summary": "24th September I attended a practice session yesterday and recorded a video of myself. Well, I do record myself practicing, but this was more like a monologue on the way. I have been thinking of recording my thoughts and sharing some of my stories, along&hellip;",
            "content_html": "<p><strong>24th September</strong></p>\n<p>I attended a practice session yesterday and recorded a video of myself. Well, I do record myself practicing, but this was more like a monologue on the way. </p>\n<p>I have been thinking of recording my thoughts and sharing some of my stories, along with visuals, for some time. A, for my own reference, and b, for people close to me to watch them. And I wanted to buy a 360 camera for some time, it just seems like the friction to record is so low with them. This happens to be the sale season on both Amazon and Flipkart, and the camera is 11k discounted with a card discount. Maybe it is the signal to buy. </p>\n<p>I want to buy it and record myself, yeah, these long monologues. But I also worry about exposing my thoughts to more people. Text requires so much effort to read; in contrast, videos require little effort. I am not very natural with word selections in Assamese or Nepali; I don't know if I shall record in Hindi. The fact that I have been doing journaling in English over the years, it is the language of my thoughts. And my parents won't understand English. Defeats the purpose of recording myself. I can switch to other languages, but recording is a great way to improve/practice this ad hoc thought structuring. I want to do this in English. It isn't for people to watch. It is for myself. And for parents, oh, they get to see me, and I will say a few words to them, and add explanation when required. </p>\n<p>To be continued...</p>\n<p><strong>27th September</strong></p>\n<p>Sounds like I am overthinking this. But hey, I have already recorded a video. No way I am overthinking. It shouldn't really matter who would understand and watch these. I shall just record. In whatever language I feel. If it is a self-talk monologue, surely it is going to be in English, or if I feel I will talk Assamese or Nepali. If I get asked by people, I will think about language. If I have a situation, the situation should dictate the language. However, I don't think I will record a situation. I think I am confused. Let's reframe the question. </p>\n<p>Why do I want to record? To structure my thoughts, practice the flow. Really? Maybe not. </p>\n<p>I want to record the video to share my thoughts, to answer my worries about recording. And while doing so, practice my flow. Can I do both? I can't. </p>\n<p>If I am recording my monologue, I don't need an extra camera, I don't need to think story. I could be sharing anything. And I can expect the audience will have some idea of what I am saying. I should still write. And my flow practice is done as well. But how can I omit my parents, who will click on the link to watch and not understand anything? </p>\n<p>This is the reason I haven't been able to share or record a 2nd one. Anyway. I will record and see how it goes. Probably I will not record that much as well, not worth thinking about this complexity.</p>\n<p>I shall revisit after recording 10th. Let's go ⚡</p>",
            "author": {
                "name": "Bikram Sutar"
            },
            "tags": [
            ],
            "date_published": "2025-09-24T17:10:58+05:30",
            "date_modified": "2025-09-27T23:47:15+05:30"
        }
    ]
}
